// @strict-types


#Область СлужебныйПрограммныйИнтерфейс

// Формирует список событий оповещения для обновления канбан доски
// Если в конфигурации используются свои объекты задачи, проекты, ошибки, то добавляем сюда событие
// которое вызывается при записи этих объектов. Доска будет обновлена.
// 
// Параметры:
//  События - Массив из Строка
//  ИмяКонфигурации - Строка
//
Процедура СобытияОбработкиОповещения(События, ИмяКонфигурации) Экспорт
	
	#Область Tasks
	
	Если ИмяКонфигурации = "УправлениеЗадачами" Тогда
		
		События.добавить("СправочникЗадачаЗаписана");
		
	КонецЕсли;
	
	#КонецОбласти
	
	#Область СистемаПроектированияПрикладныхРешений
	
	Если ИмяКонфигурации = "СистемаПроектированияПрикладныхРешений" Тогда
		
		События.Добавить("Запись_ЗадачаПроцесса");
		События.Добавить("Запись_Ошибки");
		
	КонецЕсли;
	
	#КонецОбласти
	
КонецПроцедуры

#КонецОбласти