// @strict-types


#Область СлужебныйПрограммныйИнтерфейс

// Текст запроса данные задач.
// 
// Возвращаемое значение:
//  Строка - Текст запроса данные задач
//  
//  Запрос должен вернуть поля:
// * Задача - ОпределяемыйТип.канбан_Задачи - ссылка на задачу
// * КодЗадачи - Число, Строка - код задачи
// * СтатусЗадачи - ОпределяемыйТип.канбан_СтатусыЗадач, ОпределяемыйТип.канбан_СтатусыОшибок - если используется сопоставление статусов.
// * ХранилищеФотографии - ХранилищеЗначения - фотография исполнителя задачи.
// * ПредставлениеПользователя - Строка
// * НаименованиеЗадачи - Строка - наименование задачи
// * Проект - ОпределяемыйТип.канбан_Проекты
// * Исполнитель - ОпределяемыйТип.канбан_Пользователь
// * КодПроекта - Строка
// * НаименованиеПроекта - Строка
// * УникальныйИдентификаторПроекта - Строка
//
Функция ТекстЗапросаДанныеЗадач() Экспорт
	
	Запрос = Новый Запрос;
	Если Метаданные.Имя = "СистемаПроектированияПрикладныхРешений" Тогда
		
		#Область СистемаПроектированияПрикладныхРешений
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Задачи.Ссылка КАК Задача,
			|	Задачи.Код КАК КодЗадачи,
			|	Задачи.Статус КАК СтатусЗадачи,
			|	ЕСТЬNULL(Пользователи.Фотография, """") КАК ХранилищеФотографии,
			|	ЕСТЬNULL(Пользователи.Представление, """") КАК ПредставлениеПользователя,
			|	Задачи.Наименование КАК НаименованиеЗадачи,
			|	Проекты.Ссылка КАК Проект,
			|	Задачи.Исполнитель КАК Исполнитель,
			|	Проекты.Код КАК КодПроекта,
			|	Проекты.Наименование КАК НаименованиеПроекта,
			|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Проекты.Ссылка) КАК УникальныйИдентификаторПроекта
			|ИЗ
			|	Справочник.ЗадачиПроцесса КАК Задачи
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
			|		ПО Задачи.Исполнитель = Пользователи.Ссылка
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТехническиеПроекты КАК ТехническиеПроекты
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Проекты КАК Проекты
			|			ПО ТехническиеПроекты.Владелец = Проекты.Ссылка
			|		ПО Задачи.Предмет = ТехническиеПроекты.Ссылка
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	Ошибки.Ссылка,
			|	Ошибки.Код,
			|	Ошибки.Статус,
			|	ЕСТЬNULL(Пользователи.Фотография, """"),
			|	ЕСТЬNULL(Пользователи.Представление, """"),
			|	Ошибки.Наименование,
			|	Ошибки.Владелец,
			|	Ошибки.КомуНаправлена,
			|	Проекты.Код,
			|	Проекты.Наименование,
			|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Проекты.Ссылка)
			|ИЗ
			|	Справочник.Ошибки КАК Ошибки
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
			|		ПО Ошибки.КомуНаправлена = Пользователи.Ссылка
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Проекты КАК Проекты
			|		ПО Ошибки.Владелец = Проекты.Ссылка";
			
		#КонецОбласти
		
	ИначеЕсли Метаданные.Имя = "УправлениеЗадачами" Тогда
		
		#Область Tasks
		
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Задачи.Ссылка КАК Задача,
			|	Задачи.Код КАК КодЗадачи,
			|	Задачи.Статус КАК СтатусЗадачи,
			|	ЕСТЬNULL(Пользователи.Фотография, """") КАК ХранилищеФотографии,
			|	ЕСТЬNULL(Пользователи.Представление, """") КАК ПредставлениеПользователя,
			|	Задачи.Наименование КАК НаименованиеЗадачи,
			|	ЕСТЬNULL(ЗадачиОсновные.Проект, Задачи.Проект) КАК Проект,
			|	Задачи.Исполнитель КАК Исполнитель,
			|	ЕСТЬNULL(ЗадачиОсновные.Проект.Код, Задачи.Проект.Код) КАК КодПроекта,
			|	Проекты.Наименование КАК НаименованиеПроекта,
			|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Проекты.Ссылка) КАК УникальныйИдентификаторПроекта
			|ИЗ
			|	Справочник.узЗадачи КАК Задачи
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
			|		ПО Задачи.Исполнитель = Пользователи.Ссылка
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.узЗадачи КАК ЗадачиОсновные
			|		ПО Задачи.ОсновнаяЗадача = ЗадачиОсновные.Ссылка
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.узПроекты КАК Проекты
			|		ПО (ЕСТЬNULL(ЗадачиОсновные.Проект, Задачи.Проект) = Проекты.Ссылка)
			|ГДЕ
			|	Задачи.ПоказыватьВОтчетахИКанбанДоске
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	канбан_Ошибки.Ссылка,
			|	канбан_Ошибки.Код,
			|	канбан_Ошибки.Статус,
			|	ЕСТЬNULL(Пользователи.Фотография, """"),
			|	ЕСТЬNULL(Пользователи.Представление, """"),
			|	канбан_Ошибки.Наименование,
			|	канбан_Ошибки.Проект,
			|	канбан_Ошибки.Исполнитель,
			|	Проекты.Код,
			|	Проекты.Наименование,
			|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Проекты.Ссылка)
			|ИЗ
			|	Справочник.канбан_Ошибки КАК канбан_Ошибки
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
			|		ПО канбан_Ошибки.Исполнитель = Пользователи.Ссылка
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.узПроекты КАК Проекты
			|		ПО канбан_Ошибки.Проект = Проекты.Ссылка
			|
			|УПОРЯДОЧИТЬ ПО
			|	КодПроекта,
			|	КодЗадачи";
		
	#КонецОбласти
		
	Иначе
		
		#Область КонфигурацииНаБазеБСП
		
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Задачи.Ссылка КАК Задача,
			|	Задачи.Код КАК КодЗадачи,
			|	Задачи.Статус КАК СтатусЗадачи,
			|	ЕСТЬNULL(Пользователи.Фотография, """") КАК ХранилищеФотографии,
			|	ЕСТЬNULL(Пользователи.Представление, """") КАК ПредставлениеПользователя,
			|	Задачи.Наименование КАК НаименованиеЗадачи,
			|	ЕСТЬNULL(ЗадачиОсновные.Проект, Задачи.Проект) КАК Проект,
			|	Задачи.Исполнитель КАК Исполнитель,
			|	ЕСТЬNULL(ЗадачиОсновные.Проект.Код, Задачи.Проект.Код) КАК КодПроекта,
			|	Проекты.Наименование КАК НаименованиеПроекта,
			|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Проекты.Ссылка) КАК УникальныйИдентификаторПроекта
			|ИЗ
			|	Справочник.канбан_Задачи КАК Задачи
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
			|		ПО Задачи.Исполнитель = Пользователи.Ссылка
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.канбан_Задачи КАК ЗадачиОсновные
			|		ПО Задачи.ОсновнаяЗадача = ЗадачиОсновные.Ссылка
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.канбан_Проекты КАК Проекты
			|		ПО ЕСТЬNULL(ЗадачиОсновные.Проект, Задачи.Проект) = Проекты.Ссылка
			|ГДЕ
			|	Задачи.ПоказыватьВОтчетахИКанбанДоске
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	канбан_Ошибки.Ссылка,
			|	канбан_Ошибки.Код,
			|	канбан_Ошибки.Статус,
			|	ЕСТЬNULL(Пользователи.Фотография, """"),
			|	ЕСТЬNULL(Пользователи.Представление, """"),
			|	канбан_Ошибки.Наименование,
			|	канбан_Ошибки.Проект,
			|	канбан_Ошибки.Исполнитель,
			|	канбан_Проекты.Код,
			|	канбан_Проекты.Наименование,
			|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(канбан_Проекты.Ссылка)
			|ИЗ
			|	Справочник.канбан_Ошибки КАК канбан_Ошибки
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
			|		ПО канбан_Ошибки.Исполнитель = Пользователи.Ссылка
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.канбан_Проекты КАК канбан_Проекты
			|		ПО канбан_Ошибки.Проект = канбан_Проекты.Ссылка
			|
			|УПОРЯДОЧИТЬ ПО
			|	КодПроекта,
			|	КодЗадачи";
		
	#КонецОбласти
	
	КонецЕсли;
	
	Возврат Запрос.Текст;
	
КонецФункции

// Текст запроса статусы.
// Запрос должен вернуть заполненные поля:
// * Статус - ОпределяемыйТип.канбан_СтатусыЗадач
// * Представление - Строка - представление статуса для канбан доски
// * УникальныйИдентификатор - Строка
// 
// Возвращаемое значение:
//  Строка - Текст запроса статусы
//
Функция ТекстЗапросаСтатусы() Экспорт
	
	Запрос = Новый Запрос;
	Если Метаданные.Имя = "СистемаПроектированияПрикладныхРешений" Тогда
		
		#Область СистемаПроектированияПрикладныхРешений
		// Так как статусы в конфигурации есть перечисление, используем в качестве уникального идентификатора ПРЕДСТАВЛЕНИЕССЫЛКИ
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СтатусыЗадачи.Ссылка КАК Статус,
			|	ПРЕДСТАВЛЕНИЕССЫЛКИ(СтатусыЗадачи.Ссылка) КАК Представление,
			|	ПРЕДСТАВЛЕНИЕССЫЛКИ(СтатусыЗадачи.Ссылка) КАК УникальныйИдентификатор
			|ИЗ
			|	Перечисление.СтатусыЗадачПроцессов КАК СтатусыЗадачи";
		
		#КонецОбласти
		
	ИначеЕсли Метаданные.Имя = "УправлениеЗадачами" Тогда
		
		#Область Tasks
		
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СтатусыЗадачи.Ссылка КАК Статус,
			|	ВЫБОР
			|		КОГДА СтатусыЗадачи.НаименованиеДляКанбанДоски = """"
			|			ТОГДА СтатусыЗадачи.Наименование
			|		ИНАЧЕ СтатусыЗадачи.НаименованиеДляКанбанДоски
			|	КОНЕЦ КАК Представление,
			|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(СтатусыЗадачи.Ссылка) КАК УникальныйИдентификатор
			|ИЗ
			|	Справочник.узСтатусыЗадачи КАК СтатусыЗадачи";
		
		#КонецОбласти
		
	Иначе
		
		#Область КонфигурацииНаБазеБСП
		
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СтатусыЗадачи.Ссылка КАК Статус,
			|	ВЫБОР
			|		КОГДА СтатусыЗадачи.НаименованиеДляКанбанДоски = """"
			|			ТОГДА СтатусыЗадачи.Наименование
			|		ИНАЧЕ СтатусыЗадачи.НаименованиеДляКанбанДоски
			|	КОНЕЦ КАК Представление,
			|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(СтатусыЗадачи.Ссылка) КАК УникальныйИдентификатор
			|ИЗ
			|	Справочник.канбан_СтатусыЗадач КАК СтатусыЗадачи";
		
		#КонецОбласти
		
	КонецЕсли;
	
	Возврат Запрос.Текст;
	
КонецФункции

// Изменить статус задаче.
// 
// Параметры:
//  Задача - ОпределяемыйТип.канбан_Задачи
//  Статус - ОпределяемыйТип.канбан_СтатусыЗадач - устанавливаемый статус
//  Исполнитель - ОпределяемыйТип.канбан_Пользователь
//  Отказ - Булево
//
Процедура ИзменитьСтатусЗадаче(Знач Задача, Знач Статус, Знач Исполнитель, Отказ) Экспорт
	
	#Область Tasks_КонфигурацииНаБазеБСП_СистемаПроектированияПрикладныхРешений
	
	Попытка
		
		ЗадачаОбъект = Задача.ПолучитьОбъект();
		
		ЗадачаОбъект.Заблокировать();
		
		Если ЗадачаОбъект.Статус <> Статус Тогда
			ЗадачаОбъект.Статус = Статус;
		КонецЕсли;
		
		Если ЗадачаОбъект.Исполнитель <> Исполнитель Тогда
			ЗадачаОбъект.Исполнитель = Исполнитель;
		КонецЕсли;
		
		Если ЗадачаОбъект.Модифицированность() Тогда
			ЗадачаОбъект.Записать();
		КонецЕсли;
		
	Исключение
		
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Не удалось изменить объект %1, объект может быть занят другим пользователем. Продробнее см. в журнале регистрации'"), Задача);
		ТипОперации = НСтр("ru = 'OneKanban: ИзменитьСтатусЗадаче'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Задача, , , Отказ);
		
		ЗаписьЖурналаРегистрации(
			ТипОперации, 
			УровеньЖурналаРегистрации.Ошибка, , 
			ТекстСообщения, 
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ВызватьИсключение;
		
	КонецПопытки;
	
	#КонецОбласти
	
КонецПроцедуры

// Статус задачи ссылка по идентификатору.
//
// Параметры:
//  ИмяОпределяемогоТипа - Строка
//  ИдентификаторСтатусаСтрока - Строка
//  СтатусСсылка - ОпределяемыйТип.канбан_СтатусыЗадач, ОпределяемыйТип.канбан_СтатусыОшибок - статус ссылка.
//
//@skip-check module-empty-method
Процедура СтатусОбъектаПоИдентификатору(Знач ИмяОпределяемогоТипа, Знач ИдентификаторСтатусаСтрока, СтатусСсылка) Экспорт
	
КонецПроцедуры

#КонецОбласти