// @strict-types


#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИспользуемыеСтатусыДоскиЗагрузить();
	
	ИспользуемыеПроектыДоскиЗагрузить();
	
	ИспользоватьСопоставлениеСтатусов = Константы.канбан_ИспользоватьСопоставлениеСтатусов.Получить();
	
	АдресЛоготипа = БиблиотекаКартинок.канбан_Доска;
	
	ИспользуемыеПроектыДоскиЦветПриИзмененииСервер();
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Оповещение = Новый ОписаниеОповещения("СохранитьИЗакрыть", ЭтотОбъект);
	ОбщегоНазначенияКлиент.ПоказатьПодтверждениеЗакрытияФормы(Оповещение, Отказ, Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура АдресЛоготипаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	канбан_КанбанДоскаКлиент.ОткрытьСтраницуРазработки();
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьСопоставлениеСтатусовПриИзменении(Элемент)
	
	ИспользоватьСопоставлениеСтатусовПриИзмененииСервер();
	
	УстановитьВидимостьДоступность();
	
	Оповестить("ОбновитьКанбанДоскуHTML", , ЭтотОбъект);
	
	ОбновитьИнтерфейс();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСтатусыЗадач

&НаКлиенте
Процедура СтатусыЗадачПриИзменении(Элемент)
	
	Номер = 1;
	Для Каждого СтрокаСтатуса Из СтатусыЗадач Цикл
		СтрокаСтатуса.НомерПоПорядку = Номер;
		Номер = Номер + 1;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыИспользуемыеПроектыДоски

&НаКлиенте
Процедура ИспользуемыеПроектыДоскиЦветПриИзменении(Элемент)
	
	ИспользуемыеПроектыДоскиЦветПриИзмененииСервер();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСопоставлениеСтатусов

&НаКлиенте
Процедура СопоставлениеСтатусовПриИзменении(Элемент)
	
	Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	ЗаписатьПродолжение();
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	
	ЗаписатьПродолжение();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИспользуемыеСтатусыДоскиЗагрузить()
	
	ИспользуемыеСтатусы = канбан_КанбанДоска.ИспользуемыеСтатусыДоскиЗагрузить();
	Если ЗначениеЗаполнено(ИспользуемыеСтатусы) Тогда
		
		СтатусыЗадач.Загрузить(ИспользуемыеСтатусы);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьДоступность()
	
	ИспользуемыеПроектыДоскиЦветПриИзмененииСервер();
	
	Элементы.СтраницаСопоставление.Видимость = ИспользоватьСопоставлениеСтатусов;
	
КонецПроцедуры

&НаСервере
Процедура ИспользуемыеПроектыДоскиЗагрузить()
	
	ПроектыЗагруженные = канбан_КанбанДоска.ИспользуемыеПроектыДоскиЗагрузить();
	Если ЗначениеЗаполнено(ПроектыЗагруженные) Тогда
		
		ПроектыРеквизит = РеквизитФормыВЗначение("ИспользуемыеПроектыДоски");
		Для Каждого СтрокаПроекта Из ПроектыЗагруженные Цикл
			
			НоваяСтрокаПроектыРеквизит = ПроектыРеквизит.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаПроектыРеквизит, СтрокаПроекта);
			
		КонецЦикла;
		ЗначениеВРеквизитФормы(ПроектыРеквизит, "ИспользуемыеПроектыДоски");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьПродолжение()
	
	Если Не Модифицированность Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Ложь;
	
	ЗаписатьНаСервере(Отказ);
	
	Если Не Отказ Тогда
		Модифицированность = Отказ;
	КонецЕсли;
	
	Оповестить("ОбновитьКанбанДоскуHTML", , ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаСервере(Отказ)
	
	ЗаписатьСтатусыЗадач(Отказ);
	ЗаписатьИспользуемыеПроектыДоски(Отказ);
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьСтатусыЗадач(Отказ)
	
	Статусы = СтатусыЗадач.Выгрузить();
	
	канбан_КанбанДоска.ИспользуемыеСтатусыДоскиСохранить(Статусы, Отказ);
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьИспользуемыеПроектыДоски(Отказ)
	
	ПроектыДоски = РеквизитФормыВЗначение("ИспользуемыеПроектыДоски");
	канбан_КанбанДоска.ИспользуемыеПроектыДоскиСохранить(ПроектыДоски, Отказ);
	
КонецПроцедуры

&НаСервере
Процедура ИспользуемыеПроектыДоскиЦветПриИзмененииСервер()
	
	Для Каждого СтрокаПроекта Из ИспользуемыеПроектыДоски Цикл
		
		Если ЗначениеЗаполнено(СтрокаПроекта.Цвет) Тогда
			
			ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
			
			ЭлементОтбораДанных = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбораДанных.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ИспользуемыеПроектыДоски.Цвет");
			ЭлементОтбораДанных.ВидСравнения  = ВидСравненияКомпоновкиДанных.Равно;
			ЭлементОтбораДанных.ПравоеЗначение = СтрокаПроекта.Цвет;
			ЭлементОтбораДанных.Использование = Истина;
			
			ЭлементОформляемогоПоля = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
			ЭлементОформляемогоПоля.Поле = Новый ПолеКомпоновкиДанных("ИспользуемыеПроектыДоскиЦвет");
			ЭлементОформляемогоПоля.Использование = Истина;
			
			ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", СтрокаПроекта.Цвет);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИЗакрыть(Результат = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	
	ЗаписатьПродолжение();
	Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ИспользоватьСопоставлениеСтатусовПриИзмененииСервер()
	
	ИспользоватьСопоставлениеСтатусовЗапись();
	
КонецПроцедуры

&НаСервере
Процедура ИспользоватьСопоставлениеСтатусовЗапись()
	
	ИспользоватьСопоставлениеСтатусовСохраненное = Константы.канбан_ИспользоватьСопоставлениеСтатусов.Получить();
	Если ИспользоватьСопоставлениеСтатусовСохраненное <> ИспользоватьСопоставлениеСтатусов Тогда
		
		Константы.канбан_ИспользоватьСопоставлениеСтатусов.Установить(ИспользоватьСопоставлениеСтатусов);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
