// @strict-types


#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекстHTMLКанбанДоскиНаСервере();
	
	ТипЗадач = Метаданные.ОпределяемыеТипы.канбан_Задачи.Тип.Типы()[0];
	СправочникЗадачи = Метаданные.НайтиПоТипу(ТипЗадач);
	ИмяСправочникаЗадачи = СправочникЗадачи.ПолноеИмя();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	События = канбан_КанбанДоскаКлиент.СобытияОбработкиОповещения();
	
	ДопустимоеСобытие = События.Найти(ИмяСобытия); // Строка
	Если ДопустимоеСобытие <> Неопределено Тогда
		
		Если ИмяСобытия = "ОбновитьКанбанДоскуHTML" Тогда
			
			КанбанДоска = "";
			
		КонецЕсли;
		
		ТекстHTMLКанбанДоски();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Канбан доска при нажатии.
// 
// Параметры:
//  Элемент - ПолеФормы - Элемент
//  ДанныеСобытия - Структура:
//  * Href - Строка
//  * Button - Структура:
//  ** type - Строка
//  ** id - Строка
//  ** className - Строка
//  ** parentElement - Структура:
//  *** id - Строка
//  *** parentElement - Структура:
//  **** id - Строка
//  * Element - Структура:
//  ** className - Строка
//      
//  СтандартнаяОбработка - Булево - Стандартная обработка
//
&НаКлиенте
Процедура КанбанДоскаПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(ДанныеСобытия.Href) Тогда
		
		СтандартнаяОбработка = Ложь;
		ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(ДанныеСобытия.Href);
		
		Возврат;
		
	КонецЕсли;
	
	Кнопка = ?(ДанныеСобытия.Button = Неопределено, ДанныеСобытия.Element, ДанныеСобытия.Button);
	Если Не ЗначениеЗаполнено(Кнопка) 
		// Пропускаем обработку для быстрого фильтра проектов
		Или Кнопка.type = "checkbox" Тогда
		Возврат;
	КонецЕсли;
	
	Если Кнопка.id = "V8_request" Тогда
		
		Если Кнопка.value = "changeStatus" Тогда
			
			СтандартнаяОбработка = Ложь;
			ИзменитьСтатусЗадаче(Кнопка);
			
		КонецЕсли;
		
	ИначеЕсли Кнопка.id = "update_svg" Тогда
		
		СтандартнаяОбработка = Ложь;
		ПодключитьОбработчикОжидания("ТекстHTMLКанбанДоски", 0.1, Истина);
		
	ИначеЕсли Кнопка.id = "setup_svg" Тогда
		
		СтандартнаяОбработка = Ложь;
		ОткрытьФорму("Обработка.Канбан_Доска_HTML.Форма.НастройкиДоски");
		
	ИначеЕсли Кнопка.id = "add_task" Тогда
		
		КлассыЭлемента = СтрРазделить(Кнопка.className, " ");
		
		СтандартнаяОбработка = Ложь;
		ИдентификаторСтатусаСтрока = СтрЗаменить(КлассыЭлемента[1], "status", "");
		СтатусЗадачиСсылка = СтатусЗадачиСсылка(ИдентификаторСтатусаСтрока);
		
		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("Статус", СтатусЗадачиСсылка); // Управление задач не заполняет параметры.
		
		ИмяФормыСправочникаЗадачи = СтрШаблон("%1.ФормаОбъекта", ИмяСправочникаЗадачи);
		
		ОткрытьФорму(ИмяФормыСправочникаЗадачи, ПараметрыОткрытия);
		
	ИначеЕсли Кнопка.id = "my_tasks" Тогда
		
		СтандартнаяОбработка = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ТекстHTMLКанбанДоски()
	
	Если Не ПустаяСтрока(КанбанДоска) Тогда
		
		ЭлементКанбанДоска = Элементы.КанбанДоска.Документ;
		КанбанДоска = ЭлементКанбанДоска.documentElement.innerHTML;
		
	КонецЕсли;
	
	ТекстHTMLКанбанДоскиНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ТекстHTMLКанбанДоскиНаСервере()
	
	канбан_КанбанДоска.ТекстHTMLКанбанДоски(КанбанДоска, УникальныйИдентификатор);
	
КонецПроцедуры

// Изменяет статус задачи на канбан-доске.
//
// Параметры:
//   Кнопка - Структура:
//   * attributes - Массив из Структура:
//   ** nodeValue - Строка
//
&НаКлиенте
Процедура ИзменитьСтатусЗадаче(Кнопка)
	
	ИдентификаторЗадача = СтрЗаменить(Кнопка.attributes["idtask"].nodeValue, "task", "");
	ИмяМенеджераОбъектаЗадача = Кнопка.attributes["fullnameobjecttask"].nodeValue;
	
	ИдентификаторСтатуса = Кнопка.attributes["idnewstatus"].nodeValue;
	ИмяМенеджераОбъектаСтатус = Кнопка.attributes["fullnameobjectstatus"].nodeValue;
	
	ДанныеПриИзмененииСтатуса = канбан_КанбанДоскаКлиент.НовыйДанныеПриИзмененииСтатуса();
	ДанныеПриИзмененииСтатуса.ИдентификаторЗадача = СтрЗаменить(Кнопка.attributes["idtask"].nodeValue, "task", "");
	ДанныеПриИзмененииСтатуса.ИмяМенеджераОбъектаЗадача = Кнопка.attributes["fullnameobjecttask"].nodeValue;
	ДанныеПриИзмененииСтатуса.ИдентификаторСтатуса = Кнопка.attributes["idnewstatus"].nodeValue;
	ДанныеПриИзмененииСтатуса.ИмяМенеджераОбъектаСтатус = Кнопка.attributes["fullnameobjectstatus"].nodeValue;
	
	ЗадачаСсылка = КанбанДоскаПриИзмененииСтатусаЗадаче(ДанныеПриИзмененииСтатуса);
	
	ОповеститьОбИзменении(ЗадачаСсылка);
	Оповестить("канбан_ИзменениеСтатусаЗадаче", ЗадачаСсылка);
	
КонецПроцедуры

// Канбан доска при изменении статуса задаче.
// 
// Параметры:
//  ДанныеПриИзмененииСтатуса - см. канбан_КанбанДоскаКлиент.НовыйДанныеПриИзмененииСтатуса
//
&НаСервере
Функция КанбанДоскаПриИзмененииСтатусаЗадаче(ДанныеПриИзмененииСтатуса)
	
	Отказ = Ложь;
	ЗадачаСсылка = канбан_КанбанДоска.ИзменитьСтатусЗадаче(ДанныеПриИзмененииСтатуса, Отказ);
	
	// Если задаче не был изменен статус, тогда обновляем страницу, что бы задача вернулась на место.
	Если Отказ Тогда
		ТекстHTMLКанбанДоскиНаСервере();
	КонецЕсли;
	
	Возврат ЗадачаСсылка;
	
КонецФункции

&НаСервере
Функция СтатусЗадачиСсылка(Знач ИдентификаторСтатусаСтрока)
	
	Возврат канбан_КанбанДоска.СтатусЗадачиПоИдентификатору(ИдентификаторСтатусаСтрока);
	
КонецФункции

#КонецОбласти