// @strict-types

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Параметры.Статус.Пустая() Тогда
		Объект.Статус = Параметры.Статус; // ОпределяемыйТип.канбан_СтатусыЗадач
	КонецЕсли;
	
	канбан_КанбанДоска.ТекстHTMLРедактора(СтраницаHTMLРедактора, УникальныйИдентификатор);
	
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	ИмяПользователя = ТекущийПользователь.ПолноеНаименование();
	
	Если ПустаяСтрока(Объект.ВерсияДанных) Тогда
		Объект.Статус = Справочники.канбан_СтатусыЗадач.Зарегистрирована;
	КонецЕсли;
	
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "канбан_ИзменениеСтатусаЗадаче" Тогда
		ОбновитьОбъект();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ОбновитьКанбанДоскуHTML", , ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СтраницаHTMLРедактораПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	СсылкаВЭлементеСтраницы = ДанныеСобытия.Href; // Строка
	Кнопка = ДанныеСобытия.Button; // ВнешнийОбъект
	
	Если ЗначениеЗаполнено(СсылкаВЭлементеСтраницы) Тогда // Это ссылка из текста задачи
		
		СтандартнаяОбработка = Ложь;
		
		СсылкаИБ = ПолучитьНавигационнуюСсылкуИнформационнойБазы();
		Если СтрНайти(СсылкаВЭлементеСтраницы, СсылкаИБ) Тогда
			
			ВнутренняяСсылка = СтрЗаменить(СсылкаВЭлементеСтраницы, СсылкаИБ, "");
			ВнутренняяСсылка = СтрЗаменить(ВнутренняяСсылка, "#", "");
			ПерейтиПоНавигационнойСсылке(ВнутренняяСсылка);
			
		Иначе
			
			ЗапуститьПриложение(СсылкаВЭлементеСтраницы);
			
		КонецЕсли;
		
	ИначеЕсли ЗначениеЗаполнено(Кнопка) Тогда // Это элемент верстки
		
		Если Кнопка.id = "V8_request" Тогда
			
			Событие = Кнопка.value;
			
			Если Событие = "importTasks" Тогда
				
				канбан_КанбанДоскаКлиент.ОтправитьОтвет(Элемент, Событие, Объект.Содержание);
				
			ИначеЕсли Событие = "exportTasks" Тогда
				
				// Запись текста содержания задачи в объект.
				Объект.Содержание = Кнопка.textContent;
				Модифицированность = Истина;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтоОсновнаяЗадачаПриИзменении(Элемент)
	УправлениеФормой();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьОбъект()
	
	Прочитать();
	
КонецПроцедуры

&НаСервере
Процедура УправлениеФормой()
	
	Элементы.ГруппаСодержаниеJSON.Видимость = Пользователи.ЭтоПолноправныйПользователь();
	Элементы.ОсновнаяЗадача.Доступность = Не Объект.ЭтоОсновнаяЗадача;
	Элементы.Родитель.Доступность = Не Объект.ЭтоОсновнаяЗадача;
	
КонецПроцедуры

#КонецОбласти