
#Область СлужебныйПрограммныйИнтерфейс

// Проверить текст HTMLКанбан доски.
// 
// Параметры:
//  ИмяМакета - Строка
//  ПроверяемыйТекст - Строка
//
Процедура ПроверитьТекстHTMLКанбанДоски(Знач ИмяМакета, ПроверяемыйТекст) Экспорт
	
	канбан_Тесты.ПроверитьТекстHTMLКанбанДоски(ИмяМакета, ПроверяемыйТекст);
	
КонецПроцедуры

// Изменить статус задаче.
// 
// Параметры:
//  ИдентификаторЗадачаСтрока - Строка
//  НовыйСтатусИдентификаторСтрока - Строка
//  ТекущийСтатусИдентификаторСтрока - Строка
//  ИдентификаторИсполнителяСтрока -Строка
//
Процедура ИзменитьДанныеЗадачи(
	Знач ИдентификаторЗадачаСтрока, Знач НовыйСтатусИдентификаторСтрока, 
	ТекущийСтатусИдентификаторСтрока = "", ИдентификаторИсполнителяСтрока = "") Экспорт
	
	канбан_Тесты.ИзменитьДанныеЗадачи(
		ИдентификаторЗадачаСтрока, НовыйСтатусИдентификаторСтрока, 
		ТекущийСтатусИдентификаторСтрока, ИдентификаторИсполнителяСтрока);
	
КонецПроцедуры

Функция СоздатьНовуюЗадачу() Экспорт
	
	Возврат канбан_Тесты.СоздатьНовуюЗадачу();
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти
