
#Область СлужебныйПрограммныйИнтерфейс

Процедура ПередВсемиТестами() Экспорт
	
	канбан_Тесты.ПередВсемиТестами();
	
КонецПроцедуры

// Проверить текст HTMLКанбан доски.
// 
// Параметры:
//  ИмяМакета - Строка
//  ПроверяемыйТекст - Строка
//
Процедура ПроверитьТекстHTMLКанбанДоски(Знач ИмяМакета, ПроверяемыйТекст) Экспорт
	
	канбан_Тесты.ПроверитьТекстHTMLКанбанДоски(ИмяМакета, ПроверяемыйТекст);
	
КонецПроцедуры

// Изменить статус задаче.
// 
// Параметры:
//  ИдентификаторЗадачаСтрока - Строка
//  НовыйСтатусИдентификаторСтрока - Строка
//  ТекущийСтатусИдентификаторСтрока - Строка
//  ИдентификаторИсполнителяСтрока -Строка
//
Процедура ИзменитьДанныеЗадачи(
	Знач ИдентификаторЗадачаСтрока, Знач НовыйСтатусИдентификаторСтрока, 
	ТекущийСтатусИдентификаторСтрока = "", ИдентификаторИсполнителяСтрока = "") Экспорт
	
	канбан_Тесты.ИзменитьДанныеЗадачи(
		ИдентификаторЗадачаСтрока, НовыйСтатусИдентификаторСтрока, 
		ТекущийСтатусИдентификаторСтрока, ИдентификаторИсполнителяСтрока);
	
КонецПроцедуры

Функция СоздатьНовуюЗадачу() Экспорт
	
	Возврат канбан_Тесты.СоздатьНовуюЗадачу();
	
КонецФункции

Процедура ИспользоватьСопоставлениеСтатусов(Режим) Экспорт
	
	канбан_Тесты.ИспользоватьСопоставлениеСтатусов(Режим);
	
КонецПроцедуры

Процедура канбан_ТекстHTML_ВсеПроекты_Очистить(АдресТекущихПроектов) Экспорт
	
	канбан_Тесты.канбан_ТекстHTML_ВсеПроекты_Очистить(АдресТекущихПроектов);
	
КонецПроцедуры

Процедура канбан_ТекстHTML_ВсеПроекты_Загрузить(АдресТекущихПроектов) Экспорт
	
	канбан_Тесты.канбан_ТекстHTML_ВсеПроекты_Загрузить(АдресТекущихПроектов);
	
КонецПроцедуры

Процедура ОчиститьСопоставлениеСтатусов(АдресДанных) Экспорт
	
	канбан_Тесты.ОчиститьСопоставлениеСтатусов(АдресДанных);
	
КонецПроцедуры

Процедура ВосстановитьСопоставлениеСтатусов(АдресДанных) Экспорт
	
	канбан_Тесты.ВосстановитьСопоставлениеСтатусов(АдресДанных);
	
КонецПроцедуры

Функция СоздатьНовуюОшибку() Экспорт
	
	Возврат канбан_Тесты.СоздатьНовуюОшибку();
	
КонецФункции

Процедура ИзменитьДанныеОшибки(
	Знач ИдентификаторОшибкаСтрока, Знач НовыйСтатусИдентификаторСтрока,
	ТекущийСтатусИдентификаторСтрока = "") Экспорт
	
	канбан_Тесты.ИзменитьДанныеОшибки(
		ИдентификаторОшибкаСтрока, НовыйСтатусИдентификаторСтрока,
		ТекущийСтатусИдентификаторСтрока);
	
КонецПроцедуры

Процедура УстановитьПоказыватьНаДоске(ИдентификаторЗадачаСтрока, Значение) Экспорт
	
	канбан_Тесты.УстановитьПоказыватьНаДоске(ИдентификаторЗадачаСтрока, Значение);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти
