// @strict-types


#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Получает сопоставленный статус
//
// Параметры:
//  СтатусЗадачи - ОпределяемыйТип.канбан_СтатусыЗадач
//  СтатусОшибки - ОпределяемыйТип.канбан_СтатусыОшибок
//
Процедура СопоставленныйСтатус(СтатусЗадачи, СтатусОшибки) Экспорт
	
	Условие = Не ЗначениеЗаполнено(СтатусОшибки);
	Сообщение = НСтр("ru = 'Не заполнен статус задачи или статус ошибки'");
	ОбщегоНазначенияКлиентСервер.Проверить(
		Условие, Сообщение, "РегистрСведений.канбан_СопоставлениеСтатусов.СопоставленныйСтатус");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	канбан_СопоставлениеСтатусов.СтатусОшибки КАК СтатусОшибки
		|ИЗ
		|	РегистрСведений.канбан_СопоставлениеСтатусов КАК канбан_СопоставлениеСтатусов
		|ГДЕ
		|	канбан_СопоставлениеСтатусов.СтатусЗадачи = &СтатусЗадачи";
	
	Запрос.УстановитьПараметр("СтатусЗадачи", СтатусЗадачи);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		СтатусОшибки = ВыборкаДетальныеЗаписи.СтатусОшибки; // ОпределяемыйТип.канбан_СтатусыОшибок
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли
