// @strict-types

#Область СлужебныйПрограммныйИнтерфейс

// Имя формы.
// 
// Параметры:
//  ИмяОпределяемогоТипа - Строка
// 
// Возвращаемое значение:
//  Строка - Имя формы
//
Функция ИмяФормыСпискаОпределяемогоТипа(Знач ИмяОпределяемогоТипа) Экспорт
	
	ПолноеИмяСправочника = канбан_КанбанДоска.ПолноеИмяОбъектаМетаданныхОпределяемогоТипа(ИмяОпределяемогоТипа);
	
	ИмяФормыСписка = СтрШаблон("%1.ФормаСписка", ПолноеИмяСправочника);
	
	Возврат ИмяФормыСписка;
	
КонецФункции

// Запись журнала регистрации на сервере.
// 
// Параметры:
//  ИмяСобытия - Строка
//  Комментарий - Строка - Комментарий
//  Уровень - Неопределено - Уровень
//  ОбъектМетаданных - ОбъектМетаданных, Неопределено - Объект метаданных
//  Данные - Неопределено - Данные
//
Процедура ЗаписьЖурналаРегистрацииНаСервере(ИмяСобытия, Комментарий, 
		Уровень = Неопределено, 
		ОбъектМетаданных = Неопределено, 
		Данные = Неопределено) Экспорт
	
	Если Уровень = Неопределено Тогда
		Уровень = УровеньЖурналаРегистрации.Информация;
	КонецЕсли;
	
	РежимТранзакции = РежимТранзакцииЗаписиЖурналаРегистрации.Независимая;
	
	ЗаписьЖурналаРегистрации(ИмяСобытия, Уровень, ОбъектМетаданных, Данные, Комментарий, РежимТранзакции);
	
КонецПроцедуры

// См. ОбщегоНазначения.JSONВЗначение
//
Функция JSONВЗначение(
		Знач Строка, Знач ИменаСвойствСоЗначениямиДата = Неопределено, Знач ПрочитатьВСоответствие = Истина) Экспорт

	Возврат ОбщегоНазначения.JSONВЗначение(Строка, ИменаСвойствСоЗначениямиДата, ПрочитатьВСоответствие);
	
КонецФункции

// Заполнить данные задачи для ответа.
// 
// Параметры:
//  Задача - ОпределяемыйТип.канбан_Задачи, ОпределяемыйТип.канбан_Ошибки, ПланВидовРасчетаСсылкаИмяПланаВидовРасчета, ПланСчетовСсылкаИмяПланаСчетов, ПланВидовХарактеристикСсылкаИмяПланаВидовХарактеристик, ДокументСсылкаИмяДокумента, ПланОбменаСсылкаИмяПланаОбмена, СправочникСсылкаИмяСправочника, БизнесПроцессСсылкаИмяБизнесПроцесса, ЗадачаСсылкаИмяЗадачи - Задача ссылка
//  ДанныеЗадачи - см. канбан_КанбанДоскаКлиент.НовыйДанныеЗадачиДляДоски
//
Процедура ЗаполнитьДанныеЗадачиДляОтвета(Задача, ДанныеЗадачи) Экспорт
	
	Обработки.Канбан_Доска_HTML.ЗаполнитьДанныеЗадачиДляОтвета(Задача, ДанныеЗадачи);
	
КонецПроцедуры

// Хранилище общих настроек сохранить.
// 
// Параметры:
//  КлючОбъекта - Строка
//  КлючНастроек - Строка
//  НастройкиДоски - см. канбан_КанбанДоскаКлиент.НовыйНастройкиДоски
//
Процедура ХранилищеОбщихНастроекСохранить(КлючОбъекта, КлючНастроек, НастройкиДоски) Экспорт
	
	Если ПустаяСтрока(НастройкиДоски.currentuserid) Или ПустаяСтрока(НастройкиДоски.currentusername)Тогда
		
		ТекущийПользователь = Пользователи.ТекущийПользователь();
		НастройкиДоски.currentuserid = Строка(ТекущийПользователь.УникальныйИдентификатор());
		НастройкиДоски.currentusername = Строка(ТекущийПользователь);
		
	КонецЕсли;
	
	НастройкиДоски.theme = "light";
	
	ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекСохранить(КлючОбъекта, КлючНастроек, НастройкиДоски);
	
КонецПроцедуры

#КонецОбласти