// @strict-types

#Область СлужебныйПрограммныйИнтерфейс

// Имя формы.
// 
// Параметры:
//  ИмяОпределяемогоТипа - Строка
// 
// Возвращаемое значение:
//  Строка - Имя формы
//
Функция ИмяФормыСпискаОпределяемогоТипа(Знач ИмяОпределяемогоТипа) Экспорт
	
	ПолноеИмяСправочника = канбан_КанбанДоска.ПолноеИмяОбъектаМетаданныхОпределяемогоТипа(ИмяОпределяемогоТипа);
	
	ИмяФормыСписка = СтрШаблон("%1.ФормаСписка", ПолноеИмяСправочника);
	
	Возврат ИмяФормыСписка;
	
КонецФункции

// Запись журнала регистрации на сервере.
// 
// Параметры:
//  ИмяСобытия - Строка
//  Комментарий - Строка - Комментарий
//  Уровень - Неопределено - Уровень
//  ОбъектМетаданных - ОбъектМетаданных, Неопределено - Объект метаданных
//  Данные - Неопределено - Данные
//
Процедура ЗаписьЖурналаРегистрацииНаСервере(ИмяСобытия, Комментарий, 
		Уровень = Неопределено, 
		ОбъектМетаданных = Неопределено, 
		Данные = Неопределено) Экспорт
	
	Если Уровень = Неопределено Тогда
		Уровень = УровеньЖурналаРегистрации.Информация;
	КонецЕсли;
	
	РежимТранзакции = РежимТранзакцииЗаписиЖурналаРегистрации.Независимая;
	
	ЗаписьЖурналаРегистрации(ИмяСобытия, Уровень, ОбъектМетаданных, Данные, Комментарий, РежимТранзакции);
	
КонецПроцедуры

// См. ОбщегоНазначения.JSONВЗначение
//
Функция JSONВЗначение(
		Знач Строка, Знач ИменаСвойствСоЗначениямиДата = Неопределено, Знач ПрочитатьВСоответствие = Истина) Экспорт

	Возврат ОбщегоНазначения.JSONВЗначение(Строка, ИменаСвойствСоЗначениямиДата, ПрочитатьВСоответствие);
	
КонецФункции

#КонецОбласти