// @strict-types


#Область СлужебныйПрограммныйИнтерфейс

Функция КлючОбъектаНастроекДоски() Экспорт
	
	Возврат "OneKanban";
	
КонецФункции

Функция КлючНастроекДоски() Экспорт
	
	Возврат "OneKanbanSettings";
	
КонецФункции

// Настройки доски.
// 
// Возвращаемое значение:
//  Структура - Новый настройки доски:
// * theme - Строка - тема доски
// * grouping - Строка - группировка доски
// * executorfilter - Массив из Строка - фильтр исполнителя
// * projectfilter - Массив из Строка - фильтр проекта
// * currentuserid - Строка - идентификатор текущего пользователя
// * currentusername - Строка - имя текущего пользователя
//
Функция НовыйНастройкиДоски() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("theme", "");
	Результат.Вставить("grouping", "");
	Результат.Вставить("executorfilter", Новый Массив);
	Результат.Вставить("projectfilter", Новый Массив);
	Результат.Вставить("currentuserid", "");
	Результат.Вставить("currentusername", "");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
