// @strict-types


#Область СлужебныйПрограммныйИнтерфейс

Функция КлючОбъектаНастроекДоски() Экспорт
	
	Возврат "OneKanban";
	
КонецФункции

Функция КлючНастроекДоски() Экспорт
	
	Возврат "OneKanbanSettings";
	
КонецФункции

// Настройки доски.
// 
// Возвращаемое значение:
//  Структура - Новый настройки доски:
// * theme - Строка - тема доски
// * grouping - Строка - группировка доски
// * executorfilter - Массив из Строка - фильтр исполнителя
// * projectfilter - Массив из Строка - фильтр проекта
// * urgencyfilter - Массив из Строка - фильтр по срочности ["Немедленно", "ЖелательноБыстрее"]
// * cardtypefilter - Массив из Строка - тип карточки: пусто, ["task"] или ["bug"] (не более одного значения)
// * maxvisibleprojects - Число - сколько выбранных проектов показывать «пилюлями» в панели (1-5)
// * currentuserid - Строка - идентификатор текущего пользователя
// * currentusername - Строка - имя текущего пользователя
// * urgencylevels - Массив Из КлючИЗначение:
// ** id - Строка - идентификатор уровня срочности
// ** name - Строка - имя уровня срочности
// * urgencysettings - Строка - настройки срочности на доске
//
Функция НовыйНастройкиДоски() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("theme", "light"); // light, dark
	Результат.Вставить("grouping", "");
	Результат.Вставить("executorfilter", Новый Массив);
	Результат.Вставить("projectfilter", Новый Массив);
	Результат.Вставить("urgencyfilter", Новый Массив);
	Результат.Вставить("cardtypefilter", Новый Массив);
	Результат.Вставить("maxvisibleprojects", 3);
	Результат.Вставить("currentuserid", "");
	Результат.Вставить("currentusername", "");
	Результат.Вставить("urgencylevels", Новый Массив); //	urgencylevels: [{ id: 'urgent_1', name: 'Критично' }, ...], // для фильтра и настроек
	Результат.Вставить("urgencysettings", ""); //	urgencysettings: { 'urgent_1': { iconId: 'fire', colorId: 'red' }, ... },
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
