
#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
	
	ЮТТесты
		.ДобавитьТестовыйНабор("канбан_СопоставлениеСтатусов")
			.ДобавитьСерверныйТест("СопоставленныйСтатус")
		.ДобавитьТестовыйНабор("канбан_КанбанДоска")
			.ДобавитьСерверныйТест("ИспользуемыеСтатусыДоскиСохранитьЗагрузить")
			.ДобавитьСерверныйТест("ИспользуемыеПроектыДоскиСохранитьЗагрузить")
			.ДобавитьСерверныйТест("СтатусЗадачиПоИдентификатору")
			.ДобавитьСерверныйТест("СтатусОшибкиПоИдентификатору")
		.ДобавитьТестовыйНабор("канбан_КанбанДоска_Клиент")
//			.ДобавитьКлиентскийТест("ТекстHTMLКанбанДоскиВсеПроекты")
//			.ДобавитьКлиентскийТест("ТекстHTMLКанбанДоскиВсеПроектыССопоставлением")
			.ДобавитьКлиентскийТест("канбан_ТекстHTML_ЧетыреПроекта_НетВыбора")
			.ДобавитьКлиентскийТест("канбан_ТекстHTML_ЧетыреПроекта")
			.ДобавитьКлиентскийТест("канбан_ТекстHTML_ЧетыреПроекта_Темная")
			.ДобавитьКлиентскийТест("канбан_ТекстHTML_ЧетыреПроекта_ГруппировкаПроекты_Темная")
			.ДобавитьКлиентскийТест("канбан_ТекстHTML_ЧетыреПроекта_ГруппировкаИсполнитель_Темная")
			.ДобавитьКлиентскийТест("канбан_ТекстHTML_ЧетыреПроекта_ПоискПоСтроке_Темная")
			.ДобавитьКлиентскийТест("канбан_ТекстHTML_ЧетыреПроекта_ПоискПоСтроке_ГруппировкаИсполнитель_Темная")
			.ДобавитьКлиентскийТест("канбан_ТекстHTML_ЧетыреПроекта_ПоискПоСтроке_ГруппировкаПроекты_Темная")
			.ДобавитьКлиентскийТест("канбан_ТекстHTML_ЧетыреПроекта_ГруппировкаПроекты_ИзмнениеСтатуса")
			.ДобавитьКлиентскийТест("канбан_ТекстHTML_ЧетыреПроекта_ГруппировкаИсполнитель_ИзменениеСтатуса")
			.ДобавитьКлиентскийТест("канбан_ТекстHTML_ЧетыреПроекта_ГруппировкаИсполнитель_ИзменениеПользователя")
			.ДобавитьКлиентскийТест("канбан_ТекстHTML_ЧетыреПроекта_СозданиеЗадачиВнеДоски")
//			.ДобавитьКлиентскийТест("ТекстHTMLКанбанДоскиЧетыреПроектаССопоставлением")
//			.ДобавитьКлиентскийТест("ТекстHTMLКанбанДоскиЧетыреПроектаВключеноСопоставлениеНоНеЗаполнено")
//			.ДобавитьКлиентскийТест("СозданиеОшибкиВнеДоски")
//			.ДобавитьКлиентскийТест("ИзменитьСтатусОшибке")
//			.ДобавитьКлиентскийТест("УбратьОтображениеЗадачиНаДоске")
		.ДобавитьТестовыйНабор("канбан_КанбанДоскаВызовСервера")
			.ДобавитьСерверныйТест("ИмяФормыСпискаОпределяемогоТипа")
		.ДобавитьТестовыйНабор("канбан_КанбанДоскаПереопределяемый")
			.ДобавитьСерверныйТест("ТекстЗапросаДанныеЗадач")
			.ДобавитьСерверныйТест("ТекстЗапросаСтатусы")
		.ДобавитьТестовыйНабор("канбан_Задачи")
			.ДобавитьСерверныйТест("ПустойРедактор")
		;
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область События

&НаСервере
Процедура ПередВсемиТестами() Экспорт
	
	#Область ОчисткаДанных
	
	Константы.канбан_ИспользоватьСопоставлениеСтатусов.Установить(Ложь);
	
	Отказ = Ложь;
	
	ПустыеСтатусы = канбан_КанбанДоска.НовыйСтатусыДоски();
	РегистрыСведений.канбан_ИспользуемыеСтатусыДоски.Записать(ПустыеСтатусы, Отказ);
	
	ПолноеИмяОбъектаЗадачи = канбан_КанбанДоска.ПолноеИмяОбъектаМетаданныхОпределяемогоТипа("канбан_Задачи"); // Строка
	УдалитьНеПредопределенныеЭлементы(ПолноеИмяОбъектаЗадачи);
	
	ПолноеИмяОбъектаПроекты = канбан_КанбанДоска.ПолноеИмяОбъектаМетаданныхОпределяемогоТипа("канбан_Проекты"); // Строка
	УдалитьНеПредопределенныеЭлементы(ПолноеИмяОбъектаПроекты);
	
	ПолноеИмяОбъектаСтатусы = канбан_КанбанДоска.ПолноеИмяОбъектаМетаданныхОпределяемогоТипа("канбан_СтатусыЗадач"); // Строка
	УдалитьНеПредопределенныеЭлементы(ПолноеИмяОбъектаСтатусы);
	
	ПолноеИмяОбъектаСтатусыОшибок = канбан_КанбанДоска.ПолноеИмяОбъектаМетаданныхОпределяемогоТипа("канбан_СтатусыОшибок"); // Строка
	УдалитьНеПредопределенныеЭлементы(ПолноеИмяОбъектаСтатусыОшибок);
	
	ПолноеИмяОбъектаОшибки = канбан_КанбанДоска.ПолноеИмяОбъектаМетаданныхОпределяемогоТипа("канбан_Ошибки"); // Строка
	УдалитьНеПредопределенныеЭлементы(ПолноеИмяОбъектаОшибки);
	
	#КонецОбласти
	
	#Область Проекты
	
	ПервыйПроект = ЮТест.Данные().КонструкторОбъекта(ПолноеИмяОбъектаПроекты)
		.Установить("Наименование", НСтр("ru = 'Первый проект' "))
		.УстановитьСсылкуНового("b49a3cc6-3026-11f0-952c-107b4419808b")
		.Записать()
		;
	
	ВторойПроект = ЮТест.Данные().КонструкторОбъекта(ПолноеИмяОбъектаПроекты)
		.Установить("Наименование", НСтр("ru = 'Второй проект' "))
		.УстановитьСсылкуНового("b49a3cc7-3026-11f0-952c-107b4419808b")
		.Записать()
		;
	
	// - Создание Справочник.узПроекты
	ТретийПроект = ЮТест.Данные().КонструкторОбъекта(ПолноеИмяОбъектаПроекты)
		.Установить("Наименование", НСтр("ru = 'Третий проект' "))
		.УстановитьСсылкуНового("b49a3cc8-3026-11f0-952c-107b4419808b")
		.Записать()
		;
	
	// - Создание Справочник.узПроекты
	ЧетвертыйПроект = ЮТест.Данные().КонструкторОбъекта(ПолноеИмяОбъектаПроекты)
		.Установить("Наименование", НСтр("ru = 'Четвертый проект' "))
		.УстановитьСсылкуНового("b49a3cc9-3026-11f0-952c-107b4419808b")
		.Записать()
		;
	
	// - Создание Справочник.узПроекты
	ПятыйПроект = ЮТест.Данные().КонструкторОбъекта(ПолноеИмяОбъектаПроекты)
		.Установить("Наименование", НСтр("ru = 'Пятый проект' "))
		.УстановитьСсылкуНового("b49a3cca-3026-11f0-952c-107b4419808b")
		.Записать()
		;
	
	// - Создание Справочник.узПроекты
	ШестойПроект = ЮТест.Данные().КонструкторОбъекта(ПолноеИмяОбъектаПроекты)
		.Установить("Наименование", НСтр("ru = 'Шестой проект' "))
		.УстановитьСсылкуНового("b49a3ccb-3026-11f0-952c-107b4419808b")
		.Записать()
		;
	
	// - Создание Справочник.узПроекты
	СедьмойПроект = ЮТест.Данные().КонструкторОбъекта(ПолноеИмяОбъектаПроекты)
		.Установить("Наименование", НСтр("ru = 'Седьмой проект' "))
		.УстановитьСсылкуНового("b49a3ccc-3026-11f0-952c-107b4419808b")
		.Записать()
		;
	
	// - Создание Справочник.узПроекты
	ВосьмойПроект = ЮТест.Данные().КонструкторОбъекта(ПолноеИмяОбъектаПроекты)
		.Установить("Наименование", НСтр("ru = 'Восьмой проект' "))
		.УстановитьСсылкуНового("b49a3ccd-3026-11f0-952c-107b4419808b")
		.Записать()
		;
	
	// - Создание Справочник.узПроекты
	ДевятыйПроект = ЮТест.Данные().КонструкторОбъекта(ПолноеИмяОбъектаПроекты)
		.Установить("Наименование", НСтр("ru = 'Девятый проект' "))
		.УстановитьСсылкуНового("b49a3cce-3026-11f0-952c-107b4419808b")
		.Записать()
		;
	
	// - Создание Справочник.узПроекты
	ДесятыйПроект = ЮТест.Данные().КонструкторОбъекта(ПолноеИмяОбъектаПроекты)
		.Установить("Наименование", НСтр("ru = 'Десятый проект' "))
		.УстановитьСсылкуНового("b49a3ccf-3026-11f0-952c-107b4419808b")
		.Записать()
		;
	
	// - Создание Справочник.узПроекты
	ОдиннадцатыйПроект = ЮТест.Данные().КонструкторОбъекта(ПолноеИмяОбъектаПроекты)
		.Установить("Наименование", НСтр("ru = 'Одиннадцатый проект' "))
		.УстановитьСсылкуНового("b49a3cd0-3026-11f0-952c-107b4419808b")
		.Записать()
		;
	
	// - Создание Справочник.узПроекты
	ДвенадцатыйПроект = ЮТест.Данные().КонструкторОбъекта(ПолноеИмяОбъектаПроекты)
		.Установить("Наименование", НСтр("ru = 'Двенадцатый проект' "))
		.УстановитьСсылкуНового("b49a3cd1-3026-11f0-952c-107b4419808b")
		.Записать()
		;
	
	// - Создание Справочник.узПроекты
	ТринадцатыйПроект = ЮТест.Данные().КонструкторОбъекта(ПолноеИмяОбъектаПроекты)
		.Установить("Наименование", НСтр("ru = 'Тринадцатый проект' "))
		.УстановитьСсылкуНового("b49a3cd2-3026-11f0-952c-107b4419808b")
		.Записать()
		;
	
	// - Создание Справочник.узПроекты
	ЧетырнадцатыйПроект = ЮТест.Данные().КонструкторОбъекта(ПолноеИмяОбъектаПроекты)
		.Установить("Наименование", НСтр("ru = 'Четырнадцатый проект' "))
		.УстановитьСсылкуНового("b49a3cd3-3026-11f0-952c-107b4419808b")
		.Записать()
		;
	
	// - Создание Справочник.узПроекты
	ПятнадцатыйПроект = ЮТест.Данные().КонструкторОбъекта(ПолноеИмяОбъектаПроекты)
		.Установить("Наименование", НСтр("ru = 'Пятнадцатый проект' "))
		.УстановитьСсылкуНового("b49a3cd4-3026-11f0-952c-107b4419808b")
		.Записать()
		;
	
	// - Создание Справочник.узПроекты
	ШестнадцатыйПроект = ЮТест.Данные().КонструкторОбъекта(ПолноеИмяОбъектаПроекты)
		.Установить("Наименование", НСтр("ru = 'Шестнадцатый проект' "))
		.УстановитьСсылкуНового("b49a3cd5-3026-11f0-952c-107b4419808b")
		.Записать()
		;
	
	// - Создание Справочник.узПроекты
	СемнадцатыйПроект = ЮТест.Данные().КонструкторОбъекта(ПолноеИмяОбъектаПроекты)
		.Установить("Наименование", НСтр("ru = 'Семнадцатый проект очень длинный блок' "))
		.УстановитьСсылкуНового("b49a3cd6-3026-11f0-952c-107b4419808b")
		.Записать()
		;
	
	#КонецОбласти
	
	#Область Статусы
	
	СтатусВПроцессеВыполнения = СоздатьНовыйОбъектСправочника(
		ПолноеИмяОбъектаСтатусы, "a1ca3363-c296-11ee-93e4-107b4419808b", "В процессе выполнения");
	
	СтатусГотово = СоздатьНовыйОбъектСправочника(
		ПолноеИмяОбъектаСтатусы, "a1ca3364-c296-11ee-93e4-107b4419808b", "Готово");
	
	
	СтатусЗарегистрирована = СоздатьНовыйОбъектСправочника(
		ПолноеИмяОбъектаСтатусы, "a1ca3366-c296-11ee-93e4-107b4419808b", "Зарегистрирована");
	
	
	СтатусКПереносуВРабочую = СоздатьНовыйОбъектСправочника(
		ПолноеИмяОбъектаСтатусы, "a1ca3367-c296-11ee-93e4-107b4419808b", "К переносу в рабочую");
	
	
	СтатусНаТестированииПоказПользователям = СоздатьНовыйОбъектСправочника(
		ПолноеИмяОбъектаСтатусы, "a1ca3368-c296-11ee-93e4-107b4419808b", "На тестировании");
	
	
	СтатусОжидаетОтвета = СоздатьНовыйОбъектСправочника(
		ПолноеИмяОбъектаСтатусы, "a1ca3369-c296-11ee-93e4-107b4419808b", "Ожидает ответа");
	
	
	#КонецОбласти
	
	#Область Задачи
	
	Исполнитель = Справочники.Пользователи.НайтиПоНаименованию("Администратор", Истина);
	Исполнитель1 = Справочники.Пользователи.НайтиПоНаименованию("Ермаков Виктор", Истина);
	
	#Область ПервыйЭпик
	
	ПервыйЭпик = ЮТест.Данные().КонструкторОбъекта(ПолноеИмяОбъектаЗадачи)
		.Установить("Наименование",  НСтр("ru = 'Первый эпик' "))
		.УстановитьСсылкуНового("b49a3cd7-3026-11f0-952c-107b4419808b")
		.Установить("Исполнитель", Исполнитель1)
		.Установить("Проект", ПервыйПроект)
		.Установить("Статус", СтатусЗарегистрирована)
		.Установить("ЭтоОсновнаяЗадача", Истина)
		.Установить("ПоказыватьВОтчетахИКанбанДоске", Истина)
		.Записать()
		;
	
	ПерваяЗадачаПервогоЭпика = ЮТест.Данные().КонструкторОбъекта(ПолноеИмяОбъектаЗадачи)
		.Установить("Родитель", ПервыйЭпик)
		.Установить("Наименование", НСтр("ru = 'Первая задача первого эпика' "))
		.УстановитьСсылкуНового("b49a3cd9-3026-11f0-952c-107b4419808b")
		.Установить("Исполнитель", Исполнитель1) 
		.Установить("Проект", ПервыйПроект) 
		.Установить("ОсновнаяЗадача", ПервыйЭпик) 
		.Установить("Статус", СтатусЗарегистрирована)
		.Установить("ЭтоОсновнаяЗадача", Ложь) 
		.Установить("ПоказыватьВОтчетахИКанбанДоске", Истина) 
		.Записать()
		;
	
	ВтораяЗадачаПервогоЭпика = ЮТест.Данные().КонструкторОбъекта(ПолноеИмяОбъектаЗадачи)
		.Установить("Родитель", ПервыйЭпик) 
		.Установить("Наименование", НСтр("ru = 'Вторая задача первого эпика' "))
		.УстановитьСсылкуНового("b49a3cdb-3026-11f0-952c-107b4419808b")
		.Установить("Исполнитель", Исполнитель1) 
		.Установить("Проект", ПервыйПроект) 
		.Установить("ОсновнаяЗадача", ПервыйЭпик) 
		.Установить("Статус", СтатусЗарегистрирована)
		.Установить("ЭтоОсновнаяЗадача", Ложь) 
		.Установить("ПоказыватьВОтчетахИКанбанДоске", Истина) 
		.Записать()
		;
	
	ТретяяЗадачаПервогоЭпика = ЮТест.Данные().КонструкторОбъекта(ПолноеИмяОбъектаЗадачи)
		.Установить("Родитель", ПерваяЗадачаПервогоЭпика) 
		.Установить("Наименование", НСтр("ru = 'Третья задача первого эпика' "))
		.УстановитьСсылкуНового("b49a3cdd-3026-11f0-952c-107b4419808b")
		.Установить("Исполнитель", Исполнитель1) 
		.Установить("Проект", ПервыйПроект) 
		.Установить("ОсновнаяЗадача", ПервыйЭпик) 
		.Установить("Статус", СтатусЗарегистрирована)
		.Установить("ЭтоОсновнаяЗадача", Ложь) 
		.Установить("ПоказыватьВОтчетахИКанбанДоске", Истина) 
		.Записать()
		;
	
	ЧетвертаяЗадачаПервогоЭпика = ЮТест.Данные().КонструкторОбъекта(ПолноеИмяОбъектаЗадачи)
		.Установить("Родитель", ТретяяЗадачаПервогоЭпика) 
		.Установить("Наименование", НСтр("ru = 'Четвертая задача первого эпика' "))
		.УстановитьСсылкуНового("b49a3cdf-3026-11f0-952c-107b4419808b")
		.Установить("Исполнитель", Исполнитель1) 
		.Установить("Проект", ПервыйПроект) 
		.Установить("ОсновнаяЗадача", ПервыйЭпик) 
		.Установить("Статус", СтатусЗарегистрирована)
		.Установить("ЭтоОсновнаяЗадача", Ложь) 
		.Установить("ПоказыватьВОтчетахИКанбанДоске", Истина) 
		.Записать()
		;
	
	#КонецОбласти
	
	#Область ВторойЭпик
	
	Содержание = "
	|[
	|  {
	|    ""created"": ""17.08.2025 11:09АдминистраторАдминистраторАдминистратор"",
	|    ""updated"": null,
	|    ""UserName"": ""Администратор"",
	|    ""commentId"": ""task-1755418325251"",
	|    ""content"": ""<pre class=\""ql-syntax\"" spellcheck=\""false\"">// Сохранение отредактированной задачи\nfunction saveTask(taskId) {\n&nbsp;const taskCard = document.getElementById(taskId);\n&nbsp;editMode(taskId, false);\n&nbsp;exportTasks();\n}\n</pre>""
	|  },
	|  {
	|    ""created"": ""Обновлено: 17.08.2025 11:10 АдминистраторАдминистраторАдминистратор"",
	|    ""updated"": ""17.08.2025 11:10 АдминистраторАдминистраторАдминистратор"",
	|    ""UserName"": ""Администратор"",
	|    ""commentId"": ""task-1755418325303"",
	|    ""content"": ""<p class=\""ql-indent-4\""><strong class=\""ql-size-large\"" style=\""color: rgb(153, 51, 255); background-color: rgb(204, 224, 245);\""><em>Обычный текст </em></strong><sup class=\""ql-size-large\"" style=\""color: rgb(153, 51, 255); background-color: rgb(204, 224, 245);\""><strong><em>степень</em></strong></sup><sub class=\""ql-size-large\"" style=\""color: rgb(153, 51, 255); background-color: rgb(204, 224, 245);\""><strong><em> корень</em></strong></sub></p>""
	|  },
	|  {
	|    ""created"": ""17.08.2025 11:10АдминистраторАдминистраторАдминистратор"",
	|    ""updated"": null,
	|    ""UserName"": ""Администратор"",
	|    ""commentId"": ""task-1755418325366"",
	|    ""content"": ""<ol><li class=\""ql-align-center ql-direction-rtl\""><span class=\""ql-size-huge ql-font-serif\"" style=\""color: rgb(230, 0, 0);\"">Первый пункт</span></li><li class=\""ql-align-center ql-direction-rtl\""><span class=\""ql-size-huge ql-font-serif\"" style=\""color: rgb(230, 0, 0);\"">Второй пункт</span></li><li class=\""ql-align-center ql-direction-rtl\""><span class=\""ql-size-huge ql-font-serif\"" style=\""color: rgb(230, 0, 0);\"">Третий пункт</span></li></ol>""
	|  },
	|  {
	|    ""created"": ""Обновлено: 17.08.2025 11:12 Администратор"",
	|    ""updated"": ""17.08.2025 11:12 Администратор"",
	|    ""UserName"": ""Администратор"",
	|    ""commentId"": ""task-1755418325431"",
	|    ""content"": ""<p><span class=\""ql-size-huge ql-font-monospace\"" style=\""background-color: rgb(102, 185, 102);\"">Четвертый </span><span class=\""ql-size-huge ql-font-monospace\"" style=\""background-color: rgb(102, 185, 102); color: rgb(161, 0, 0);\"">комментарий</span></p>""
	|  }
	|]
	|";
	
	ВторойЭпик = ЮТест.Данные().КонструкторОбъекта(ПолноеИмяОбъектаЗадачи)
		.Установить("Наименование",  НСтр("ru = 'Второй эпик' "))
		.УстановитьСсылкуНового("b49a3ce1-3026-11f0-952c-107b4419808b")
		.Установить("Исполнитель", Исполнитель1) 
		.Установить("Проект", ВторойПроект) 
		.Установить("Статус", СтатусОжидаетОтвета)
		.Установить("ЭтоОсновнаяЗадача", Истина) 
		.Установить("ПоказыватьВОтчетахИКанбанДоске", Истина) 
		.Установить("Содержание", Содержание)
		.Записать()
		;
	
	ПерваяЗадачаВторогоЭпика = ЮТест.Данные().КонструкторОбъекта(ПолноеИмяОбъектаЗадачи)
		.Установить("Родитель", ВторойЭпик) 
		.Установить("Наименование", НСтр("ru = 'Первая задача второго эпика' "))
		.УстановитьСсылкуНового("b49a3ce3-3026-11f0-952c-107b4419808b")
		.Установить("Исполнитель", Исполнитель) 
		.Установить("Проект", ВторойПроект)
		.Установить("ОсновнаяЗадача", ВторойЭпик) 
		.Установить("Статус", СтатусОжидаетОтвета)
		.Установить("ЭтоОсновнаяЗадача", Ложь) 
		.Установить("ПоказыватьВОтчетахИКанбанДоске", Истина) 
		.Записать()
		;
	
	ВтораяЗадачаВторогоЭпика = ЮТест.Данные().КонструкторОбъекта(ПолноеИмяОбъектаЗадачи)
		.Установить("Родитель", ВторойЭпик) 
		.Установить("Наименование", НСтр("ru = 'Вторая задача второго эпика' "))
		.УстановитьСсылкуНового("b49a3ce4-3026-11f0-952c-107b4419808b")
		.Установить("Исполнитель", Исполнитель) 
		.Установить("Проект", ВторойПроект)
		.Установить("ОсновнаяЗадача", ВторойЭпик) 
		.Установить("Статус", СтатусОжидаетОтвета)
		.Установить("ЭтоОсновнаяЗадача", Ложь) 
		.Установить("ПоказыватьВОтчетахИКанбанДоске", Истина) 
		.Записать()
		;
	
	ТретяяЗадачаВторогоЭпика = ЮТест.Данные().КонструкторОбъекта(ПолноеИмяОбъектаЗадачи)
		.Установить("Родитель", ВтораяЗадачаВторогоЭпика) 
		.Установить("Наименование", НСтр("ru = 'Третья задача второго эпика' "))
		.УстановитьСсылкуНового("b49a3ce5-3026-11f0-952c-107b4419808b")
		.Установить("Исполнитель", Исполнитель) 
		.Установить("Проект", ВторойПроект)
		.Установить("ОсновнаяЗадача", ВторойЭпик) 
		.Установить("Статус", СтатусОжидаетОтвета)
		.Установить("ЭтоОсновнаяЗадача", Ложь) 
		.Установить("ПоказыватьВОтчетахИКанбанДоске", Истина) 
		.Записать()
		;
	
	ЧетвертаяЗадачаВторогоЭпика = ЮТест.Данные().КонструкторОбъекта(ПолноеИмяОбъектаЗадачи)
		.Установить("Родитель", ВторойЭпик) 
		.Установить("Наименование", НСтр("ru = 'Четвертая задача второго эпика' "))
		.УстановитьСсылкуНового("b49a3ce6-3026-11f0-952c-107b4419808b")
		.Установить("Исполнитель", Исполнитель) 
		.Установить("Проект", ВторойПроект)
		.Установить("ОсновнаяЗадача", ВторойЭпик) 
		.Установить("Статус", СтатусОжидаетОтвета)
		.Установить("ЭтоОсновнаяЗадача", Ложь) 
		.Установить("ПоказыватьВОтчетахИКанбанДоске", Истина) 
		.Записать()
		;
//	b49a3ce6-3026-11f0-952c-107b4419808b
	#КонецОбласти
	
	#Область ТретийЭпик
	
	ТретийЭпик = ЮТест.Данные().КонструкторОбъекта(ПолноеИмяОбъектаЗадачи)
		.Установить("Наименование",  НСтр("ru = 'Третий эпик' "))
		.УстановитьСсылкуНового("b49a3ce7-3026-11f0-952c-107b4419808b")
		.Установить("Исполнитель", Исполнитель) 
		.Установить("Проект", ТретийПроект) 
		.Установить("Статус", СтатусВПроцессеВыполнения)
		.Установить("ЭтоОсновнаяЗадача", Истина) 
		.Установить("ПоказыватьВОтчетахИКанбанДоске", Истина) 
		.Записать()
		;
	
	ПерваяЗадачаТретьегоЭпика = ЮТест.Данные().КонструкторОбъекта(ПолноеИмяОбъектаЗадачи)
		.Установить("Родитель", ТретийЭпик) 
		.Установить("Наименование", НСтр("ru = 'Первая задача третьего эпика' "))
		.УстановитьСсылкуНового("b49a3ce8-3026-11f0-952c-107b4419808b")
		.Установить("Исполнитель", Исполнитель1) 
		.Установить("Проект", ТретийПроект) 
		.Установить("ОсновнаяЗадача", ТретийЭпик) 
		.Установить("Статус", СтатусВПроцессеВыполнения)
		.Установить("ЭтоОсновнаяЗадача", Ложь) 
		.Установить("ПоказыватьВОтчетахИКанбанДоске", Истина) 
		.Записать()
		;
	
	ТретяяЗадачаТретьегоЭпика = ЮТест.Данные().КонструкторОбъекта(ПолноеИмяОбъектаЗадачи)
		.Установить("Родитель", ТретийЭпик) 
		.Установить("Наименование", НСтр("ru = 'Третяя задача третьего эпика' "))
		.УстановитьСсылкуНового("b49a3cea-3026-11f0-952c-107b4419808b")
		.Установить("Исполнитель", Исполнитель1) 
		.Установить("Проект", ТретийПроект) 
		.Установить("ОсновнаяЗадача", ТретийЭпик) 
		.Установить("Статус", СтатусВПроцессеВыполнения)
		.Установить("ЭтоОсновнаяЗадача", Ложь) 
		.Установить("ПоказыватьВОтчетахИКанбанДоске", Истина) 
		.Записать()
		;
	
	ВтораяЗадачаТретьегоЭпика = ЮТест.Данные().КонструкторОбъекта(ПолноеИмяОбъектаЗадачи)
		.Установить("Родитель", ТретяяЗадачаТретьегоЭпика) 
		.Установить("Наименование", НСтр("ru = 'Вторая задача третьего эпика' "))
		.УстановитьСсылкуНового("b49a3cec-3026-11f0-952c-107b4419808b")
		.Установить("Исполнитель", Исполнитель1) 
		.Установить("Проект", ТретийПроект)
		.Установить("ОсновнаяЗадача", ТретийЭпик) 
		.Установить("Статус", СтатусВПроцессеВыполнения)
		.Установить("ЭтоОсновнаяЗадача", Ложь) 
		.Установить("ПоказыватьВОтчетахИКанбанДоске", Истина) 
		.Записать()
		;
	
	#КонецОбласти
	
	#Область ЧетвертыйЭпик
	
	ЧетвертыйЭпик = ЮТест.Данные().КонструкторОбъекта(ПолноеИмяОбъектаЗадачи)
		.Установить("Наименование",  НСтр("ru = 'Четвертый эпик' "))
		.УстановитьСсылкуНового("b49a3cee-3026-11f0-952c-107b4419808b")
		.Установить("Проект", ЧетвертыйПроект)
		.Установить("Исполнитель", Исполнитель)
		.Установить("Статус", СтатусНаТестированииПоказПользователям)
		.Установить("ЭтоОсновнаяЗадача", Истина) 
		.Установить("ПоказыватьВОтчетахИКанбанДоске", Истина) 
		.Записать()
		;
	
	ПерваяЗадачаЧетвертогоЭпика = ЮТест.Данные().КонструкторОбъекта(ПолноеИмяОбъектаЗадачи)
		.Установить("Родитель", ЧетвертыйЭпик) 
		.Установить("Наименование", НСтр("ru = 'Первая задача четвертого эпика' "))
		.УстановитьСсылкуНового("b49a3cef-3026-11f0-952c-107b4419808b")
		.Установить("Проект", ЧетвертыйПроект) 
		.Установить("Исполнитель", Исполнитель1) 
		.Установить("ОсновнаяЗадача", ЧетвертыйЭпик) 
		.Установить("Статус", СтатусНаТестированииПоказПользователям)
		.Установить("ЭтоОсновнаяЗадача", Ложь) 
		.Установить("ПоказыватьВОтчетахИКанбанДоске", Истина) 
		.Записать()
		;
	
	#КонецОбласти
	
	#Область ОстальныеПроекты
	
	ПерваяЗадачаПятогоБлока = ЮТест.Данные().КонструкторОбъекта(ПолноеИмяОбъектаЗадачи)
		.Установить("Наименование", НСтр("ru = 'Первая задача пятого блока' "))
		.УстановитьСсылкуНового("b49a3cf1-3026-11f0-952c-107b4419808b")
		.Установить("Исполнитель", Исполнитель) 
		.Установить("Проект", ПятыйПроект) 
		.Установить("Статус", СтатусКПереносуВРабочую)
		.Установить("ЭтоОсновнаяЗадача", Истина) 
		.Установить("ПоказыватьВОтчетахИКанбанДоске", Истина) 
		.Записать()
		;
	
	ПерваяЗадачаШестогоПроекта = ЮТест.Данные().КонструкторОбъекта(ПолноеИмяОбъектаЗадачи)
		.Установить("Наименование", НСтр("ru = 'Первая задача шестого проекта' "))
		.УстановитьСсылкуНового("b49a3cf2-3026-11f0-952c-107b4419808b")
		.Установить("Исполнитель", Исполнитель) 
		.Установить("Проект", ШестойПроект) 
		.Установить("Статус", СтатусКПереносуВРабочую)
		.Установить("ЭтоОсновнаяЗадача", Истина) 
		.Установить("ПоказыватьВОтчетахИКанбанДоске", Истина) 
		.Записать()
		;
	
	ПерваяЗадачаСедьмогоПроекта = ЮТест.Данные().КонструкторОбъекта(ПолноеИмяОбъектаЗадачи)
		.Установить("Наименование", НСтр("ru = 'Первая задача седьмого проекта' "))
		.УстановитьСсылкуНового("b49a3cf3-3026-11f0-952c-107b4419808b")
		.Установить("Исполнитель", Исполнитель) 
		.Установить("Проект", СедьмойПроект) 
		.Установить("Статус", СтатусКПереносуВРабочую)
		.Установить("ЭтоОсновнаяЗадача", Истина) 
		.Установить("ПоказыватьВОтчетахИКанбанДоске", Истина) 
		.Записать()
		;
	
	ПерваяЗадачаВосьмогоПроекта = ЮТест.Данные().КонструкторОбъекта(ПолноеИмяОбъектаЗадачи)
		.Установить("Наименование", НСтр("ru = 'Первая задача восьмого проекта' "))
		.УстановитьСсылкуНового("b49a3cf4-3026-11f0-952c-107b4419808b")
		.Установить("Исполнитель", Исполнитель) 
		.Установить("Проект", ВосьмойПроект) 
		.Установить("Статус", СтатусКПереносуВРабочую)
		.Установить("ЭтоОсновнаяЗадача", Истина) 
		.Установить("ПоказыватьВОтчетахИКанбанДоске", Истина) 
		.Записать()
		;
	
	ПерваяЗадачаДевятогоПроекта = ЮТест.Данные().КонструкторОбъекта(ПолноеИмяОбъектаЗадачи)
		.Установить("Наименование", НСтр("ru = 'Первая задача девятого проекта' "))
		.УстановитьСсылкуНового("b49a3cf5-3026-11f0-952c-107b4419808b")
		.Установить("Исполнитель", Исполнитель) 
		.Установить("Проект", ДевятыйПроект) 
		.Установить("Статус", СтатусКПереносуВРабочую)
		.Установить("ЭтоОсновнаяЗадача", Истина) 
		.Установить("ПоказыватьВОтчетахИКанбанДоске", Истина) 
		.Записать()
		;
	
	ПерваяЗадачаДесятогоПроекта = ЮТест.Данные().КонструкторОбъекта(ПолноеИмяОбъектаЗадачи)
		.Установить("Наименование", НСтр("ru = 'Первая задача десятого проекта' "))
		.УстановитьСсылкуНового("b49a3cf6-3026-11f0-952c-107b4419808b")
		.Установить("Исполнитель", Исполнитель) 
		.Установить("Проект", ДесятыйПроект) 
		.Установить("Статус", СтатусКПереносуВРабочую)
		.Установить("ЭтоОсновнаяЗадача", Истина) 
		.Установить("ПоказыватьВОтчетахИКанбанДоске", Истина) 
		.Записать()
		;
	
	ПерваяЗадачаОдинацдатогоПроекта = ЮТест.Данные().КонструкторОбъекта(ПолноеИмяОбъектаЗадачи)
		.Установить("Наименование", НСтр("ru = 'Первая задача одинацдатого проекта' "))
		.УстановитьСсылкуНового("b49a3cf7-3026-11f0-952c-107b4419808b")
		.Установить("Исполнитель", Исполнитель) 
		.Установить("Проект", ОдиннадцатыйПроект) 
		.Установить("Статус", СтатусКПереносуВРабочую)
		.Установить("ЭтоОсновнаяЗадача", Истина) 
		.Установить("ПоказыватьВОтчетахИКанбанДоске", Истина) 
		.Записать()
		;
	
	ПерваяЗадачаДвенадцатогоПроекта = ЮТест.Данные().КонструкторОбъекта(ПолноеИмяОбъектаЗадачи)
		.Установить("Наименование", НСтр("ru = 'Первая задача двенадцатого проекта' "))
		.УстановитьСсылкуНового("b49a3cf8-3026-11f0-952c-107b4419808b")
		.Установить("Исполнитель", Исполнитель) 
		.Установить("Проект", ДвенадцатыйПроект) 
		.Установить("Статус", СтатусКПереносуВРабочую)
		.Установить("ЭтоОсновнаяЗадача", Истина) 
		.Установить("ПоказыватьВОтчетахИКанбанДоске", Истина) 
		.Записать()
		;
	
	ПерваяЗадачаТринадцатогоПроекта = ЮТест.Данные().КонструкторОбъекта(ПолноеИмяОбъектаЗадачи)
		.Установить("Наименование", НСтр("ru = 'Первая задача тринадцатого проекта' "))
		.УстановитьСсылкуНового("b49a3cf9-3026-11f0-952c-107b4419808b")
		.Установить("Исполнитель", Исполнитель) 
		.Установить("Проект", ТринадцатыйПроект) 
		.Установить("Статус", СтатусКПереносуВРабочую)
		.Установить("ЭтоОсновнаяЗадача", Истина) 
		.Установить("ПоказыватьВОтчетахИКанбанДоске", Истина) 
		.Записать()
		;
	
	ПерваяЗадачаЧетырнадцатогоПроекта = ЮТест.Данные().КонструкторОбъекта(ПолноеИмяОбъектаЗадачи)
		.Установить("Наименование", НСтр("ru = 'Первая задача четырнадцатого проекта' "))
		.УстановитьСсылкуНового("b49a3cfa-3026-11f0-952c-107b4419808b")
		.Установить("Исполнитель", Исполнитель) 
		.Установить("Проект", ЧетырнадцатыйПроект) 
		.Установить("Статус", СтатусКПереносуВРабочую)
		.Установить("ЭтоОсновнаяЗадача", Истина) 
		.Установить("ПоказыватьВОтчетахИКанбанДоске", Истина) 
		.Записать()
		;
	
	ПерваяЗадачаПятнадцатогоПроекта = ЮТест.Данные().КонструкторОбъекта(ПолноеИмяОбъектаЗадачи)
		.Установить("Наименование", НСтр("ru = 'Первая задача пятнадцатого проекта' "))
		.УстановитьСсылкуНового("b49a3cfb-3026-11f0-952c-107b4419808b")
		.Установить("Исполнитель", Исполнитель) 
		.Установить("Проект", ПятнадцатыйПроект) 
		.Установить("Статус", СтатусКПереносуВРабочую)
		.Установить("ЭтоОсновнаяЗадача", Истина) 
		.Установить("ПоказыватьВОтчетахИКанбанДоске", Истина) 
		.Записать()
		;
	
	ПерваяЗадачаШестнадцатогоПроекта = ЮТест.Данные().КонструкторОбъекта(ПолноеИмяОбъектаЗадачи)
		.Установить("Наименование", НСтр("ru = 'Первая задача шестнадцатого проекта' "))
		.УстановитьСсылкуНового("b49a3cfc-3026-11f0-952c-107b4419808b")
		.Установить("Исполнитель", Исполнитель)
		.Установить("Проект", ШестнадцатыйПроект)
		.Установить("Статус", СтатусКПереносуВРабочую)
		.Установить("ЭтоОсновнаяЗадача", Истина)
		.Установить("ПоказыватьВОтчетахИКанбанДоске", Истина)
		.Записать()
		;
	
	ПерваяЗадачаСемнадцатогоПроекта = ЮТест.Данные().КонструкторОбъекта(ПолноеИмяОбъектаЗадачи)
		.Установить("Наименование", НСтр("ru = 'Первая задача семнадцатого проекта' "))
		.УстановитьСсылкуНового("b49a3cfd-3026-11f0-952c-107b4419808b")
		.Установить("Исполнитель", Исполнитель)
		.Установить("Проект", СемнадцатыйПроект)
		.Установить("Статус", СтатусКПереносуВРабочую)
		.Установить("ЭтоОсновнаяЗадача", Истина)
		.Установить("ПоказыватьВОтчетахИКанбанДоске", Истина)
		.Записать()
		;
	
	#КонецОбласти
	
	#КонецОбласти
	
	#Область СтатусыОшибок
	
	ПолноеИмяОбъектаСтатусыОшибок = "Справочник.канбан_СтатусыОшибок";
	
	ВПроцессеВыполненияОшибка = СоздатьНовыйОбъектСправочника(
		ПолноеИмяОбъектаСтатусыОшибок, "d0eb69d9-b7c6-11f0-954d-107b4419808b", НСтр("ru = 'В процессе выполнения ошибка' "));
	
	ГотовоОшибка = СоздатьНовыйОбъектСправочника(
		ПолноеИмяОбъектаСтатусыОшибок, "37cd62c8-b7c7-11f0-954d-107b4419808b", НСтр("ru = 'Готово ошибка' "));
	
	ЗарегистрированаОшибка = СоздатьНовыйОбъектСправочника(
		ПолноеИмяОбъектаСтатусыОшибок, "d0eb69d8-b7c6-11f0-954d-107b4419808b", НСтр("ru = 'Зарегистрирована ошибка' "));
	
	КПереносуВРабочуюОшибка = СоздатьНовыйОбъектСправочника(
		ПолноеИмяОбъектаСтатусыОшибок, "37cd62c7-b7c7-11f0-954d-107b4419808b", НСтр("ru = 'К переносу в рабочую ошибка' "));
	
	НаТестированииОшибка = СоздатьНовыйОбъектСправочника(
		ПолноеИмяОбъектаСтатусыОшибок, "37cd62c6-b7c7-11f0-954d-107b4419808b", НСтр("ru = 'На тестировании ошибка' "));
	
	ОжидаетОтветаОшибка = СоздатьНовыйОбъектСправочника(
		ПолноеИмяОбъектаСтатусыОшибок, "28461b2e-b5c9-11f0-954d-107b4419808b", НСтр("ru = 'Ожидает ответа ошибка' "));
	
	#КонецОбласти
	
	#Область Ошибки
	
	ПерваяОшибка = ЮТест.Данные().КонструкторОбъекта("Справочник.канбан_Ошибки")
		.Установить("Наименование", НСтр("ru = 'Ошибка #1' "))
		.УстановитьСсылкуНового("894d3446-bffc-11f0-954d-107b4419808b")
		.Установить("Проект", ПервыйПроект)
		.Установить("Статус", ЗарегистрированаОшибка) 
		.Установить("Исполнитель", Исполнитель)
		.Записать()
		;
	
	ВтораяОшибка = ЮТест.Данные().КонструкторОбъекта("Справочник.канбан_Ошибки")
		.УстановитьСсылкуНового("894d3447-bffc-11f0-954d-107b4419808b")
		.Установить("Наименование", НСтр("ru = 'Ошибка #2' "))
		.Установить("Проект", ВторойПроект)
		.Установить("Статус", ОжидаетОтветаОшибка) 
		.Установить("Исполнитель", Исполнитель1)
		.Записать()
		;
	
	#КонецОбласти
	
	#Область НастройкиСтатусы
	
	ТекущиеСтатусы = канбан_КанбанДоска.НовыйСтатусыДоски();
	
	Зарегистрирована = ТекущиеСтатусы.Добавить();
	Зарегистрирована.СтатусЗадачи = СтатусЗарегистрирована;
	Зарегистрирована.НомерПоПорядку = 1;
	Зарегистрирована.КнопкаДобавить = Истина;
	
	ОжидаетОтвета = ТекущиеСтатусы.Добавить();
	ОжидаетОтвета.СтатусЗадачи = СтатусОжидаетОтвета;
	ОжидаетОтвета.НомерПоПорядку = 2;
	ОжидаетОтвета.КнопкаДобавить = Ложь;
	
	ВПроцессеВыполнения = ТекущиеСтатусы.Добавить();
	ВПроцессеВыполнения.СтатусЗадачи = СтатусВПроцессеВыполнения;
	ВПроцессеВыполнения.НомерПоПорядку = 3;
	ВПроцессеВыполнения.КнопкаДобавить = Ложь;
	
	НаТестированииПоказПользователям = ТекущиеСтатусы.Добавить();
	НаТестированииПоказПользователям.СтатусЗадачи = СтатусНаТестированииПоказПользователям;
	НаТестированииПоказПользователям.НомерПоПорядку = 4;
	НаТестированииПоказПользователям.КнопкаДобавить = Ложь;
	
	КПереносуВРабочую = ТекущиеСтатусы.Добавить();
	КПереносуВРабочую.СтатусЗадачи = СтатусКПереносуВРабочую;
	КПереносуВРабочую.НомерПоПорядку = 5;
	КПереносуВРабочую.КнопкаДобавить = Ложь;
	
	Готово = ТекущиеСтатусы.Добавить();
	Готово.СтатусЗадачи = СтатусГотово;
	Готово.НомерПоПорядку = 6;
	Готово.КнопкаДобавить = Ложь;
	
	канбан_КанбанДоска.ИспользуемыеСтатусыДоскиСохранить(ТекущиеСтатусы);
	
	#КонецОбласти
	
	#Область НастройкиПроекты
	
	ТекущиеПроекты = канбан_КанбанДоска.НовыйПроектыДоски();
	
	ПервыйПроектНастройки = ТекущиеПроекты.Добавить();
	ПервыйПроектНастройки.Проект = ПервыйПроект;
	ПервыйПроектНастройки.Цвет = канбан_КанбанДоска.ЦветИзСтроки("208,32,144");
	ПервыйПроектНастройки.ИдентификаторПроектаСтрока = Строка(ПервыйПроект.УникальныйИдентификатор());
	
	ВторойПроектНастройки = ТекущиеПроекты.Добавить();
	ВторойПроектНастройки.Проект = ВторойПроект;
	ВторойПроектНастройки.Цвет = канбан_КанбанДоска.ЦветИзСтроки("0,128,0");
	ВторойПроектНастройки.ИдентификаторПроектаСтрока = Строка(ВторойПроект.УникальныйИдентификатор());
	
	ТретийПроектНастройки = ТекущиеПроекты.Добавить();
	ТретийПроектНастройки.Проект = ТретийПроект;
	ТретийПроектНастройки.Цвет = канбан_КанбанДоска.ЦветИзСтроки("178,34,34");
	ТретийПроектНастройки.ИдентификаторПроектаСтрока = Строка(ТретийПроект.УникальныйИдентификатор());
	
	ЧетвертыйПроектНастройки = ТекущиеПроекты.Добавить();
	ЧетвертыйПроектНастройки.Проект = ЧетвертыйПроект;
	ЧетвертыйПроектНастройки.Цвет = канбан_КанбанДоска.ЦветИзСтроки("28,85,174");
	ЧетвертыйПроектНастройки.ИдентификаторПроектаСтрока = Строка(ЧетвертыйПроект.УникальныйИдентификатор());
	
	канбан_КанбанДоска.ИспользуемыеПроектыДоскиСохранить(ТекущиеПроекты);
	
	#КонецОбласти
	
	#Область СопоставлениеСтатусов
	
	СопоставлениеСтатусов = РегистрыСведений.канбан_СопоставлениеСтатусов.СоздатьМенеджерЗаписи();
	СопоставлениеСтатусов.СтатусЗадачи = СтатусВПроцессеВыполнения;
	СопоставлениеСтатусов.СтатусОшибки = ВПроцессеВыполненияОшибка;
	СопоставлениеСтатусов.Записать();
	
	СопоставлениеСтатусов = РегистрыСведений.канбан_СопоставлениеСтатусов.СоздатьМенеджерЗаписи();
	СопоставлениеСтатусов.СтатусЗадачи = СтатусГотово;
	СопоставлениеСтатусов.СтатусОшибки = ГотовоОшибка;
	СопоставлениеСтатусов.Записать();
	
	СопоставлениеСтатусов = РегистрыСведений.канбан_СопоставлениеСтатусов.СоздатьМенеджерЗаписи();
	СопоставлениеСтатусов.СтатусЗадачи = СтатусЗарегистрирована;
	СопоставлениеСтатусов.СтатусОшибки = ЗарегистрированаОшибка;
	СопоставлениеСтатусов.Записать();
	
	СопоставлениеСтатусов = РегистрыСведений.канбан_СопоставлениеСтатусов.СоздатьМенеджерЗаписи();
	СопоставлениеСтатусов.СтатусЗадачи = СтатусКПереносуВРабочую;
	СопоставлениеСтатусов.СтатусОшибки = КПереносуВРабочуюОшибка;
	СопоставлениеСтатусов.Записать();
	
	СопоставлениеСтатусов = РегистрыСведений.канбан_СопоставлениеСтатусов.СоздатьМенеджерЗаписи();
	СопоставлениеСтатусов.СтатусЗадачи = СтатусНаТестированииПоказПользователям;
	СопоставлениеСтатусов.СтатусОшибки = НаТестированииОшибка;
	СопоставлениеСтатусов.Записать();
	
	СопоставлениеСтатусов = РегистрыСведений.канбан_СопоставлениеСтатусов.СоздатьМенеджерЗаписи();
	СопоставлениеСтатусов.СтатусЗадачи = СтатусОжидаетОтвета;
	СопоставлениеСтатусов.СтатусОшибки = ОжидаетОтветаОшибка;
	СопоставлениеСтатусов.Записать();
	
	#КонецОбласти
	
КонецПроцедуры

&НаКлиенте
Процедура ПередВсемиТестами() Экспорт
	
	//@skip-check undefined-variable
	НастройкиДоски = канбан_КанбанДоскаКлиентСервер.НовыйНастройкиДоски();
	//@skip-check undefined-variable
	канбан_КанбанДоскаКлиент.СохранитьТекущиеНастройкиДоски(НастройкиДоски);
	//@skip-check undefined-variable
	
КонецПроцедуры

#КонецОбласти

#Область канбан_КанбанДоска

&НаСервере
Процедура СопоставленныйСтатус() Экспорт
	
	ИдентификаторСтатусЗадачиВПроцессеВыполненияСтрока = "a1ca3363-c296-11ee-93e4-107b4419808b";
	СтатусВПроцессеВыполнения = канбан_КанбанДоска.СсылкаНаОбъектПоИдентификатору(
		Метаданные.Справочники.канбан_СтатусыЗадач.ПолноеИмя(), ИдентификаторСтатусЗадачиВПроцессеВыполненияСтрока);
	
	СтатусОшибкиТип = Метаданные.ОпределяемыеТипы.канбан_СтатусыОшибок.Тип.Типы()[0];
	СтатусОшибки = Новый (СтатусОшибкиТип);
	Отказ = Ложь;
	
	ЮТест.ОжидаетЧто(канбан_КанбанДоска)
		.Метод("СопоставленныйСтатус").Параметр(СтатусВПроцессеВыполнения).Параметр(СтатусОшибки).Параметр(Отказ)
		.НеВыбрасываетИсключение()
	;
	
	канбан_КанбанДоска.СопоставленныйСтатус(СтатусВПроцессеВыполнения, СтатусОшибки, Отказ);
	
	ИдентификаторСтатусОшибкиВПроцессеВыполненияСтрока = "d0eb69d9-b7c6-11f0-954d-107b4419808b";
	СтатусОшибкиВПроцессеВыполнения = канбан_КанбанДоска.СсылкаНаОбъектПоИдентификатору(
		Метаданные.Справочники.канбан_СтатусыОшибок.ПолноеИмя(), ИдентификаторСтатусОшибкиВПроцессеВыполненияСтрока);
	
	Ютест.ОжидаетЧто(СтатусОшибки)
		.Заполнено()
		.Равно(СтатусОшибкиВПроцессеВыполнения)
	;
	
КонецПроцедуры

&НаСервере
Процедура ИспользуемыеСтатусыДоскиСохранитьЗагрузить() Экспорт
	
	ТекущиеСтатусы = канбан_КанбанДоска.ИспользуемыеСтатусыДоскиЗагрузить();
	
	Отказ = Ложь;
	
	ЮТест.ОжидаетЧто(канбан_КанбанДоска)
		.Метод("ИспользуемыеСтатусыДоскиСохранить").Параметр(ТекущиеСтатусы).Параметр(Отказ)
		.НеВыбрасываетИсключение()
	;
	
	Ютест.ОжидаетЧто(Отказ)
		.Равно(Ложь);
	
	ЗагруженныеСтатусы = канбан_КанбанДоска.ИспользуемыеСтатусыДоскиЗагрузить();
	
	Ютест.ОжидаетЧто(ЗагруженныеСтатусы)
		.ИмеетТип("ТаблицаЗначений")
		.Заполнено()
		.Равно(ТекущиеСтатусы)
	;
	
КонецПроцедуры

&НаСервере
Процедура ИспользуемыеПроектыДоскиСохранитьЗагрузить() Экспорт
	
	ТекущиеПроекты = канбан_КанбанДоска.ИспользуемыеПроектыДоскиЗагрузить();
	
	Отказ = Ложь;
	
	ЮТест.ОжидаетЧто(канбан_КанбанДоска)
		.Метод("ИспользуемыеПроектыДоскиСохранить").Параметр(ТекущиеПроекты).Параметр(Отказ)
		.НеВыбрасываетИсключение();
	
	Ютест.ОжидаетЧто(Отказ)
		.Равно(Ложь);
	
	ЗагруженныеПроекты = канбан_КанбанДоска.ИспользуемыеПроектыДоскиЗагрузить();
	
	Ютест.ОжидаетЧто(ЗагруженныеПроекты)
		.ИмеетТип("ТаблицаЗначений")
		.Заполнено()
		.Равно(ТекущиеПроекты)
	;
	
КонецПроцедуры

&НаСервере
Процедура ТекстHTMLКанбанДоскиЧетыреПроектаССопоставлением() Экспорт
	
	Константы.канбан_ИспользоватьСопоставлениеСтатусов.Установить(Истина);
	
	ПроверитьТекстHTMLКанбанДоски("канбан_ТекстHTMLДоскиЧетыреПроектаССопоставлением");
	
	Константы.канбан_ИспользоватьСопоставлениеСтатусов.Установить(Ложь);
	
КонецПроцедуры

&НаСервере
Процедура ТекстHTMLКанбанДоскиЧетыреПроектаВключеноСопоставлениеНоНеЗаполнено() Экспорт
	
	НаборЗаписей = РегистрыСведений.канбан_СопоставлениеСтатусов.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	ТаблицаСопоставления = НаборЗаписей.Выгрузить();
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать();
	
	Константы.канбан_ИспользоватьСопоставлениеСтатусов.Установить(Истина);
	
	ПроверитьТекстHTMLКанбанДоски("канбан_ТекстHTMLДоскиЧетыреПроекта");
	
	Константы.канбан_ИспользоватьСопоставлениеСтатусов.Установить(Ложь);
	
	НаборЗаписей.Загрузить(ТаблицаСопоставления);
	НаборЗаписей.Записать();
	
КонецПроцедуры

&НаСервере
Процедура ТекстHTMLКанбанДоскиВсеПроектыССопоставлением() Экспорт
	
	Константы.канбан_ИспользоватьСопоставлениеСтатусов.Установить(Истина);
	
	ПроверитьТекстHTMLКанбанДоски("канбан_ТекстHTMLДоскиВсеПроектыССопоставлением");
	
	Константы.канбан_ИспользоватьСопоставлениеСтатусов.Установить(Ложь);
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьСтатусОшибке() Экспорт
	
	Отказ = Ложь;
	
	ИдентификаторОшибкаСтрока = "894d3446-bffc-11f0-954d-107b4419808b";
	ИдентификаторОшибка = Новый УникальныйИдентификатор(ИдентификаторОшибкаСтрока);
	
	ТипЗадачи = Метаданные.ОпределяемыеТипы.канбан_Ошибки.Тип.Типы()[0];
	ПустаяСсылкаОшибка = Новый (ТипЗадачи); // ОпределяемыйТип.канбан_Ошибки
	МенеджерОшибок = ОбщегоНазначения.МенеджерОбъектаПоСсылке(ПустаяСсылкаОшибка);
	
	ОшибкаСсылка = МенеджерОшибок.ПолучитьСсылку(ИдентификаторОшибка);
	ТекущийСтатус = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОшибкаСсылка, "Статус");
	
	ТипСтатус = Метаданные.ОпределяемыеТипы.канбан_СтатусыОшибок.Тип.Типы()[0];
	МетаданныеСтатус = Метаданные.НайтиПоТипу(ТипСтатус);
	МенеджерСтатус = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(МетаданныеСтатус.ПолноеИмя());
	Выборка = МенеджерСтатус.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ТекущийСтатус <> Выборка.Ссылка Тогда
			НовыйСтатусСсылка = Выборка.Ссылка;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	ТекущийСтатусИдентификатор = Строка(ТекущийСтатус.УникальныйИдентификатор());
	НовыйСтатусИдентификатор = Строка(НовыйСтатусСсылка.УникальныйИдентификатор());
	Исполнитель = Справочники.Пользователи.НайтиПоНаименованию("Администратор", Истина);
	
	ДанныеПриИзмененииСтатуса = Новый Структура;
	ДанныеПриИзмененииСтатуса.Вставить("ИдентификаторЗадача", ИдентификаторОшибкаСтрока);
	ДанныеПриИзмененииСтатуса.Вставить("ИмяМенеджераОбъектаЗадача", Метаданные.НайтиПоТипу(ТипЗадачи).ПолноеИмя());
	ДанныеПриИзмененииСтатуса.Вставить("ИдентификаторСтатуса", НовыйСтатусИдентификатор);
	ДанныеПриИзмененииСтатуса.Вставить("ИмяМенеджераОбъектаСтатус", МетаданныеСтатус.ПолноеИмя());
	ДанныеПриИзмененииСтатуса.Вставить("ИдентификаторИсполнителя", Исполнитель.УникальныйИдентификатор());
	
	ЮТест.ОжидаетЧто(канбан_КанбанДоска)
		.Метод("ИзменитьСтатусЗадаче").Параметр(ДанныеПриИзмененииСтатуса).Параметр(Отказ)
		.НеВыбрасываетИсключение()
		;
	
	Ютест.ОжидаетЧто(Отказ)
		.Равно(Ложь);
	
	ТекущийСтатусПослеИзменения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОшибкаСсылка, "Статус");
	
	Ютест.ОжидаетЧто(ТекущийСтатусПослеИзменения)
		.Заполнено()
		.Равно(НовыйСтатусСсылка)
		;
	
	ДанныеПриИзмененииСтатуса.ИдентификаторЗадача = ИдентификаторОшибкаСтрока;
	ДанныеПриИзмененииСтатуса.ИдентификаторСтатуса = ТекущийСтатусИдентификатор;
	
	ЮТест.ОжидаетЧто(канбан_КанбанДоска)
		.Метод("ИзменитьСтатусЗадаче").Параметр(ДанныеПриИзмененииСтатуса).Параметр(Отказ)
		.НеВыбрасываетИсключение()
	;
	
	ТекущийСтатусПослеИзменения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОшибкаСсылка, "Статус");
	
	Ютест.ОжидаетЧто(Отказ)
		.Равно(Ложь);
	
	Ютест.ОжидаетЧто(ТекущийСтатусПослеИзменения)
		.Заполнено()
		.Равно(ТекущийСтатус)
		;
	
КонецПроцедуры

&НаСервере
Процедура СтатусЗадачиПоИдентификатору() Экспорт
	
	ТипСсылки = Метаданные.ОпределяемыеТипы.канбан_СтатусыЗадач.Тип.Типы()[0];
	МетаданныеСсылки = Метаданные.НайтиПоТипу(ТипСсылки);
	МенеджерСсылки = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(МетаданныеСсылки.ПолноеИмя());
	Выборка = МенеджерСсылки.Выбрать();
	Выборка.Следующий();
	СсылкаТипа = Выборка.Ссылка;
	ИдентификаторСсылкиСтрока = СсылкаТипа.УникальныйИдентификатор();
	
	ЮТест.ОжидаетЧто(канбан_КанбанДоска)
		.Метод("СсылкаНаОбъектПоИдентификатору")
			.Параметр(МетаданныеСсылки.ПолноеИмя()).Параметр(ИдентификаторСсылкиСтрока)
		.НеВыбрасываетИсключение()
		;
	
	ПолученнаяСсылка = канбан_КанбанДоска.СсылкаНаОбъектПоИдентификатору(
		МетаданныеСсылки.ПолноеИмя(), ИдентификаторСсылкиСтрока);
	
	Ютест.ОжидаетЧто(ПолученнаяСсылка)
		.Заполнено()
		.Свойство("ВерсияДанных").Заполнено()
		.Объект().Равно(СсылкаТипа)
		;
	
КонецПроцедуры

&НаСервере
Процедура СтатусОшибкиПоИдентификатору() Экспорт
	
	ТипСсылки = Метаданные.ОпределяемыеТипы.канбан_СтатусыОшибок.Тип.Типы()[0];
	МетаданныеСсылки = Метаданные.НайтиПоТипу(ТипСсылки);
	МенеджерСсылки = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(МетаданныеСсылки.ПолноеИмя());
	Выборка = МенеджерСсылки.Выбрать();
	Выборка.Следующий();
	СсылкаТипа = Выборка.Ссылка;
	ИдентификаторСсылкиСтрока = СсылкаТипа.УникальныйИдентификатор();
	
	ЮТест.ОжидаетЧто(канбан_КанбанДоска)
		.Метод("СсылкаНаОбъектПоИдентификатору")
			.Параметр(МетаданныеСсылки.ПолноеИмя()).Параметр(ИдентификаторСсылкиСтрока)
		.НеВыбрасываетИсключение()
		;
	
	ПолученнаяСсылка = канбан_КанбанДоска.СсылкаНаОбъектПоИдентификатору(
		МетаданныеСсылки.ПолноеИмя(), ИдентификаторСсылкиСтрока);
	
	Ютест.ОжидаетЧто(ПолученнаяСсылка)
		.Заполнено()
		.Свойство("ВерсияДанных").Заполнено()
		.Объект().Равно(СсылкаТипа)
		;
	
КонецПроцедуры

&НаСервере
Процедура ИмяФормыСпискаОпределяемогоТипа() Экспорт
	
	ИмяОпределяемогоТипа = "канбан_Задачи";
	
	ЮТест.ОжидаетЧто(канбан_КанбанДоскаВызовСервера)
		.Метод("ИмяФормыСпискаОпределяемогоТипа").Параметр(ИмяОпределяемогоТипа)
		.НеВыбрасываетИсключение()
		;
	
	ПроверочнаяСтрока = "Справочник.канбан_Задачи.ФормаСписка";
	
	ИмяФормы = канбан_КанбанДоскаВызовСервера.ИмяФормыСпискаОпределяемогоТипа(ИмяОпределяемогоТипа);
	
	Ютест.ОжидаетЧто(ИмяФормы)
		.Заполнено()
		.Равно(ПроверочнаяСтрока)
		;
	
КонецПроцедуры

#КонецОбласти

#Область канбан_КанбанДоскаКлиент

&НаКлиенте
Процедура ТекстHTMLКанбанДоскиВсеПроекты() Экспорт
	
	// Удаляем настройки отображения проектов, что бы показывались все проекты
//	НаборЗаписей = РегистрыСведений.канбан_ИспользуемыеПроектыДоски.СоздатьНаборЗаписей();
//	НаборЗаписей.Отбор.Пользователь.Установить(Пользователи.ТекущийПользователь());
//	НаборЗаписей.Записать();
	
	ПроверитьТекстHTMLКанбанДоски("канбан_ТекстHTMLДоскиВсеПроекты");
	
КонецПроцедуры

&НаКлиенте
Процедура канбан_ТекстHTML_ЧетыреПроекта_НетВыбора() Экспорт
	
	РеквизитКанбанДоска = ТекстРеквизитаФормыКанбанДоска();
	
	// проверить до добавления проектов, как есть форму
	канбан_ТестыВызовСервера.ПроверитьТекстHTMLКанбанДоски(
		"канбан_ТекстHTML_ЧетыреПроекта_НетВыбора", РеквизитКанбанДоска);
	
КонецПроцедуры

&НаКлиенте
Процедура канбан_ТекстHTML_ЧетыреПроекта() Экспорт
	
	//@skip-check undefined-variable
	НастройкиДоски = канбан_КанбанДоскаКлиент.ЗагрузитьТекщиеНастройкиДоски();
	НастройкиДоски.projectfilter.Очистить();
	НастройкиДоски.projectfilter.Добавить("projectb49a3cc7-3026-11f0-952c-107b4419808b");
	НастройкиДоски.projectfilter.Добавить("projectb49a3cc6-3026-11f0-952c-107b4419808b");
	НастройкиДоски.projectfilter.Добавить("projectb49a3cc8-3026-11f0-952c-107b4419808b");
	НастройкиДоски.projectfilter.Добавить("projectb49a3cc9-3026-11f0-952c-107b4419808b");
	
	//@skip-check undefined-variable
	канбан_КанбанДоскаКлиент.СохранитьТекущиеНастройкиДоски(НастройкиДоски);
	
	РеквизитКанбанДоска = ТекстРеквизитаФормыКанбанДоска();
	
	канбан_ТестыВызовСервера.ПроверитьТекстHTMLКанбанДоски(
		"канбан_ТекстHTML_ЧетыреПроекта", РеквизитКанбанДоска);
	
КонецПроцедуры

&НаКлиенте
Процедура канбан_ТекстHTML_ЧетыреПроекта_Темная() Экспорт
	
	//@skip-check undefined-variable
	НастройкиДоски = канбан_КанбанДоскаКлиент.ЗагрузитьТекщиеНастройкиДоски();
	НастройкиДоски.projectfilter.Очистить();
	НастройкиДоски.projectfilter.Добавить("projectb49a3cc7-3026-11f0-952c-107b4419808b");
	НастройкиДоски.projectfilter.Добавить("projectb49a3cc6-3026-11f0-952c-107b4419808b");
	НастройкиДоски.projectfilter.Добавить("projectb49a3cc8-3026-11f0-952c-107b4419808b");
	НастройкиДоски.projectfilter.Добавить("projectb49a3cc9-3026-11f0-952c-107b4419808b");
	НастройкиДоски.theme = "dark";
	
	//@skip-check undefined-variable
	канбан_КанбанДоскаКлиент.СохранитьТекущиеНастройкиДоски(НастройкиДоски);
	
	РеквизитКанбанДоска = ТекстРеквизитаФормыКанбанДоска();
	
	канбан_ТестыВызовСервера.ПроверитьТекстHTMLКанбанДоски(
		"канбан_ТекстHTML_ЧетыреПроекта_Темная", РеквизитКанбанДоска);
	
КонецПроцедуры

&НаКлиенте
Процедура канбан_ТекстHTML_ЧетыреПроекта_ГруппировкаПроекты_Темная() Экспорт
	
	//@skip-check undefined-variable
	НастройкиДоски = канбан_КанбанДоскаКлиент.ЗагрузитьТекщиеНастройкиДоски();
	НастройкиДоски.projectfilter.Очистить();
	НастройкиДоски.projectfilter.Добавить("projectb49a3cc7-3026-11f0-952c-107b4419808b");
	НастройкиДоски.projectfilter.Добавить("projectb49a3cc6-3026-11f0-952c-107b4419808b");
	НастройкиДоски.projectfilter.Добавить("projectb49a3cc8-3026-11f0-952c-107b4419808b");
	НастройкиДоски.projectfilter.Добавить("projectb49a3cc9-3026-11f0-952c-107b4419808b");
	НастройкиДоски.theme = "dark";
	НастройкиДоски.grouping = "project"; //executor;project;none
	
	//@skip-check undefined-variable
	канбан_КанбанДоскаКлиент.СохранитьТекущиеНастройкиДоски(НастройкиДоски);
	
	РеквизитКанбанДоска = ТекстРеквизитаФормыКанбанДоска();
	
	канбан_ТестыВызовСервера.ПроверитьТекстHTMLКанбанДоски(
		"канбан_ТекстHTML_ЧетыреПроекта_ГруппировкаПроекты_Темная", РеквизитКанбанДоска);
	
КонецПроцедуры

&НаКлиенте
Процедура канбан_ТекстHTML_ЧетыреПроекта_ГруппировкаИсполнитель_Темная() Экспорт
	
	//@skip-check undefined-variable
	НастройкиДоски = канбан_КанбанДоскаКлиент.ЗагрузитьТекщиеНастройкиДоски();
	НастройкиДоски.projectfilter.Очистить();
	НастройкиДоски.projectfilter.Добавить("projectb49a3cc7-3026-11f0-952c-107b4419808b");
	НастройкиДоски.projectfilter.Добавить("projectb49a3cc6-3026-11f0-952c-107b4419808b");
	НастройкиДоски.projectfilter.Добавить("projectb49a3cc8-3026-11f0-952c-107b4419808b");
	НастройкиДоски.projectfilter.Добавить("projectb49a3cc9-3026-11f0-952c-107b4419808b");
	НастройкиДоски.theme = "dark";
	НастройкиДоски.grouping = "executor"; //executor;project;none
	
	//@skip-check undefined-variable
	канбан_КанбанДоскаКлиент.СохранитьТекущиеНастройкиДоски(НастройкиДоски);
	
	РеквизитКанбанДоска = ТекстРеквизитаФормыКанбанДоска();
	
	канбан_ТестыВызовСервера.ПроверитьТекстHTMLКанбанДоски(
		"канбан_ТекстHTML_ЧетыреПроекта_ГруппировкаИсполнитель_Темная", РеквизитКанбанДоска);
	
КонецПроцедуры

&НаКлиенте
Процедура канбан_ТекстHTML_ЧетыреПроекта_ПоискПоСтроке_Темная() Экспорт
	
	//@skip-check undefined-variable
	НастройкиДоски = канбан_КанбанДоскаКлиент.ЗагрузитьТекщиеНастройкиДоски();
	НастройкиДоски.projectfilter.Очистить();
	НастройкиДоски.projectfilter.Добавить("projectb49a3cc7-3026-11f0-952c-107b4419808b");
	НастройкиДоски.projectfilter.Добавить("projectb49a3cc6-3026-11f0-952c-107b4419808b");
	НастройкиДоски.projectfilter.Добавить("projectb49a3cc8-3026-11f0-952c-107b4419808b");
	НастройкиДоски.projectfilter.Добавить("projectb49a3cc9-3026-11f0-952c-107b4419808b");
	НастройкиДоски.theme = "dark";
	НастройкиДоски.grouping = "none"; //executor;project;none
	НастройкиДоски.Вставить("search", "четв");
	
	//@skip-check undefined-variable
	канбан_КанбанДоскаКлиент.СохранитьТекущиеНастройкиДоски(НастройкиДоски);
	
	РеквизитКанбанДоска = ТекстРеквизитаФормыКанбанДоска();
	
	канбан_ТестыВызовСервера.ПроверитьТекстHTMLКанбанДоски(
		"канбан_ТекстHTML_ЧетыреПроекта_ПоискПоСтроке_Темная", РеквизитКанбанДоска);
	
КонецПроцедуры

&НаКлиенте
Процедура канбан_ТекстHTML_ЧетыреПроекта_ПоискПоСтроке_ГруппировкаИсполнитель_Темная() Экспорт
	
	//@skip-check undefined-variable
	НастройкиДоски = канбан_КанбанДоскаКлиент.ЗагрузитьТекщиеНастройкиДоски();
	НастройкиДоски.projectfilter.Очистить();
	НастройкиДоски.projectfilter.Добавить("projectb49a3cc7-3026-11f0-952c-107b4419808b");
	НастройкиДоски.projectfilter.Добавить("projectb49a3cc6-3026-11f0-952c-107b4419808b");
	НастройкиДоски.projectfilter.Добавить("projectb49a3cc8-3026-11f0-952c-107b4419808b");
	НастройкиДоски.projectfilter.Добавить("projectb49a3cc9-3026-11f0-952c-107b4419808b");
	НастройкиДоски.theme = "dark";
	НастройкиДоски.grouping = "executor"; //executor;project;none
	НастройкиДоски.Вставить("search", "четв");
	
	//@skip-check undefined-variable
	канбан_КанбанДоскаКлиент.СохранитьТекущиеНастройкиДоски(НастройкиДоски);
	
	РеквизитКанбанДоска = ТекстРеквизитаФормыКанбанДоска();
	
	канбан_ТестыВызовСервера.ПроверитьТекстHTMLКанбанДоски(
		"канбан_ТекстHTML_ЧетыреПроекта_ПоискПоСтроке_ГруппировкаИсполнитель_Темная", РеквизитКанбанДоска);
	
КонецПроцедуры

&НаКлиенте
Процедура канбан_ТекстHTML_ЧетыреПроекта_ПоискПоСтроке_ГруппировкаПроекты_Темная() Экспорт
	
	//@skip-check undefined-variable
	НастройкиДоски = канбан_КанбанДоскаКлиент.ЗагрузитьТекщиеНастройкиДоски();
	НастройкиДоски.projectfilter.Очистить();
	НастройкиДоски.projectfilter.Добавить("projectb49a3cc7-3026-11f0-952c-107b4419808b");
	НастройкиДоски.projectfilter.Добавить("projectb49a3cc6-3026-11f0-952c-107b4419808b");
	НастройкиДоски.projectfilter.Добавить("projectb49a3cc8-3026-11f0-952c-107b4419808b");
	НастройкиДоски.projectfilter.Добавить("projectb49a3cc9-3026-11f0-952c-107b4419808b");
	НастройкиДоски.theme = "dark";
	НастройкиДоски.grouping = "project"; //executor;project;none
	НастройкиДоски.Вставить("search", "четв");
	
	//@skip-check undefined-variable
	канбан_КанбанДоскаКлиент.СохранитьТекущиеНастройкиДоски(НастройкиДоски);
	
	РеквизитКанбанДоска = ТекстРеквизитаФормыКанбанДоска();
	
	канбан_ТестыВызовСервера.ПроверитьТекстHTMLКанбанДоски(
		"канбан_ТекстHTML_ЧетыреПроекта_ПоискПоСтроке_ГруппировкаПроекты_Темная", РеквизитКанбанДоска);
	
КонецПроцедуры

&НаКлиенте
Процедура канбан_ТекстHTML_ЧетыреПроекта_ГруппировкаПроекты_ИзмнениеСтатуса() Экспорт
	
	ИдентификаторЗадачаСтрока = "b49a3cd7-3026-11f0-952c-107b4419808b"; // Первый эпик
	НовыйСтатусИдентификаторСтрока = "a1ca3367-c296-11ee-93e4-107b4419808b"; // СтатусКПереносуВРабочую
	ТекущийСтатусИдентификаторСтрока = "";
	
	канбан_ТестыВызовСервера.ИзменитьДанныеЗадачи(
		ИдентификаторЗадачаСтрока, НовыйСтатусИдентификаторСтрока, ТекущийСтатусИдентификаторСтрока);
	
	//@skip-check undefined-variable
	НастройкиДоски = канбан_КанбанДоскаКлиент.ЗагрузитьТекщиеНастройкиДоски();
	НастройкиДоски.projectfilter.Очистить();
	НастройкиДоски.projectfilter.Добавить("projectb49a3cc7-3026-11f0-952c-107b4419808b");
	НастройкиДоски.projectfilter.Добавить("projectb49a3cc6-3026-11f0-952c-107b4419808b");
	НастройкиДоски.projectfilter.Добавить("projectb49a3cc8-3026-11f0-952c-107b4419808b");
	НастройкиДоски.projectfilter.Добавить("projectb49a3cc9-3026-11f0-952c-107b4419808b");
	НастройкиДоски.theme = "light";
	НастройкиДоски.grouping = ""; //executor;project;none
	НастройкиДоски.Удалить("search");
	
	//@skip-check undefined-variable
	канбан_КанбанДоскаКлиент.СохранитьТекущиеНастройкиДоски(НастройкиДоски);
	
	РеквизитКанбанДоска = ТекстРеквизитаФормыКанбанДоска();
	
	канбан_ТестыВызовСервера.ПроверитьТекстHTMLКанбанДоски(
		"канбан_ТекстHTML_ЧетыреПроекта_ГруппировкаПроекты_ИзмнениеСтатуса", РеквизитКанбанДоска);
	
	канбан_ТестыВызовСервера.ИзменитьДанныеЗадачи(
		ИдентификаторЗадачаСтрока, ТекущийСтатусИдентификаторСтрока, "");
	
	РеквизитКанбанДоска = ТекстРеквизитаФормыКанбанДоска();
	
	канбан_ТестыВызовСервера.ПроверитьТекстHTMLКанбанДоски("канбан_ТекстHTML_ЧетыреПроекта", РеквизитКанбанДоска);
	
КонецПроцедуры

&НаКлиенте
Процедура канбан_ТекстHTML_ЧетыреПроекта_ГруппировкаИсполнитель_ИзменениеСтатуса() Экспорт
	
	ИдентификаторЗадачаСтрока = "b49a3cd7-3026-11f0-952c-107b4419808b"; // Первый эпик
	НовыйСтатусИдентификаторСтрока = "a1ca3367-c296-11ee-93e4-107b4419808b"; // СтатусКПереносуВРабочую
	ТекущийСтатусИдентификаторСтрока = "";
	
	канбан_ТестыВызовСервера.ИзменитьДанныеЗадачи(
		ИдентификаторЗадачаСтрока, 
		НовыйСтатусИдентификаторСтрока, 
		ТекущийСтатусИдентификаторСтрока);
	
	//@skip-check undefined-variable
	НастройкиДоски = канбан_КанбанДоскаКлиент.ЗагрузитьТекщиеНастройкиДоски();
	НастройкиДоски.projectfilter.Очистить();
	НастройкиДоски.projectfilter.Добавить("projectb49a3cc7-3026-11f0-952c-107b4419808b");
	НастройкиДоски.projectfilter.Добавить("projectb49a3cc6-3026-11f0-952c-107b4419808b");
	НастройкиДоски.projectfilter.Добавить("projectb49a3cc8-3026-11f0-952c-107b4419808b");
	НастройкиДоски.projectfilter.Добавить("projectb49a3cc9-3026-11f0-952c-107b4419808b");
	НастройкиДоски.theme = "dark";
	НастройкиДоски.grouping = "executor"; //executor;project;none
	
	//@skip-check undefined-variable
	канбан_КанбанДоскаКлиент.СохранитьТекущиеНастройкиДоски(НастройкиДоски);
	
	РеквизитКанбанДоска = ТекстРеквизитаФормыКанбанДоска();
	
	канбан_ТестыВызовСервера.ПроверитьТекстHTMLКанбанДоски(
		"канбан_ТекстHTML_ЧетыреПроекта_ГруппировкаИсполнитель_ИзменениеСтатуса", РеквизитКанбанДоска);
	
	канбан_ТестыВызовСервера.ИзменитьДанныеЗадачи(
		ИдентификаторЗадачаСтрока, ТекущийСтатусИдентификаторСтрока, "");
	
	РеквизитКанбанДоска = ТекстРеквизитаФормыКанбанДоска();
	
	канбан_ТестыВызовСервера.ПроверитьТекстHTMLКанбанДоски(
		"канбан_ТекстHTML_ЧетыреПроекта_ГруппировкаИсполнитель_Темная", РеквизитКанбанДоска);
	
КонецПроцедуры

&НаКлиенте
Процедура канбан_ТекстHTML_ЧетыреПроекта_ГруппировкаИсполнитель_ИзменениеПользователя() Экспорт
	
	ИдентификаторЗадачаСтрока = "b49a3cd7-3026-11f0-952c-107b4419808b"; // Первый эпик
	НовыйСтатусИдентификаторСтрока = "a1ca3367-c296-11ee-93e4-107b4419808b"; // СтатусКПереносуВРабочую
	ТекущийСтатусИдентификаторСтрока = "";
	
	ИсполнительАдминистраторСтрока = "e7e28f5a-8d7e-11de-a1ba-005056c00008"; // Адм
	
	канбан_ТестыВызовСервера.ИзменитьДанныеЗадачи(
		ИдентификаторЗадачаСтрока, 
		НовыйСтатусИдентификаторСтрока, 
		ТекущийСтатусИдентификаторСтрока, 
		ИсполнительАдминистраторСтрока);
	
	//@skip-check undefined-variable
	НастройкиДоски = канбан_КанбанДоскаКлиент.ЗагрузитьТекщиеНастройкиДоски();
	НастройкиДоски.projectfilter.Очистить();
	НастройкиДоски.projectfilter.Добавить("projectb49a3cc7-3026-11f0-952c-107b4419808b");
	НастройкиДоски.projectfilter.Добавить("projectb49a3cc6-3026-11f0-952c-107b4419808b");
	НастройкиДоски.projectfilter.Добавить("projectb49a3cc8-3026-11f0-952c-107b4419808b");
	НастройкиДоски.projectfilter.Добавить("projectb49a3cc9-3026-11f0-952c-107b4419808b");
	НастройкиДоски.theme = "dark";
	НастройкиДоски.grouping = "executor"; //executor;project;none
	
	//@skip-check undefined-variable
	канбан_КанбанДоскаКлиент.СохранитьТекущиеНастройкиДоски(НастройкиДоски);
	
	РеквизитКанбанДоска = ТекстРеквизитаФормыКанбанДоска();
	
	канбан_ТестыВызовСервера.ПроверитьТекстHTMLКанбанДоски(
		"канбан_ТекстHTML_ЧетыреПроекта_ГруппировкаИсполнитель_ИзменениеПользователя", РеквизитКанбанДоска);
	
	ИсполнительЕрмаковСтрока = "074f17ec-ce19-11f0-9551-107b4419808b"; // Ермаков Виктор
	
	канбан_ТестыВызовСервера.ИзменитьДанныеЗадачи(
		ИдентификаторЗадачаСтрока, 
		ТекущийСтатусИдентификаторСтрока, 
		"", 
		ИсполнительЕрмаковСтрока);
	
	РеквизитКанбанДоска = ТекстРеквизитаФормыКанбанДоска();
	
	канбан_ТестыВызовСервера.ПроверитьТекстHTMLКанбанДоски(
		"канбан_ТекстHTML_ЧетыреПроекта_ГруппировкаИсполнитель_Темная", РеквизитКанбанДоска);
	
КонецПроцедуры

&НаКлиенте
Процедура канбан_ТекстHTML_ЧетыреПроекта_СозданиеЗадачиВнеДоски() Экспорт
	
	канбан_ТестыВызовСервера.СоздатьНовуюЗадачу();
	
	//@skip-check undefined-variable
	НастройкиДоски = канбан_КанбанДоскаКлиент.ЗагрузитьТекщиеНастройкиДоски();
	НастройкиДоски.projectfilter.Очистить();
	НастройкиДоски.projectfilter.Добавить("projectb49a3cc7-3026-11f0-952c-107b4419808b");
	НастройкиДоски.projectfilter.Добавить("projectb49a3cc6-3026-11f0-952c-107b4419808b");
	НастройкиДоски.projectfilter.Добавить("projectb49a3cc8-3026-11f0-952c-107b4419808b");
	НастройкиДоски.projectfilter.Добавить("projectb49a3cc9-3026-11f0-952c-107b4419808b");
	НастройкиДоски.theme = "dark";
	НастройкиДоски.grouping = ""; //executor;project;none
	
	//@skip-check undefined-variable
	канбан_КанбанДоскаКлиент.СохранитьТекущиеНастройкиДоски(НастройкиДоски);
	
	РеквизитКанбанДоска = ТекстРеквизитаФормыКанбанДоска();
	
	канбан_ТестыВызовСервера.ПроверитьТекстHTMLКанбанДоски(
		"канбан_ТекстHTML_ЧетыреПроекта_СозданиеЗадачиВнеДоски", РеквизитКанбанДоска);
	
КонецПроцедуры

#КонецОбласти

#Область канбан_КанбанДоскаПереопределяемый

&НаСервере
Процедура ТекстЗапросаДанныеЗадач() Экспорт
	
	ТекстЗапроса = канбан_КанбанДоскаПереопределяемый.ТекстЗапросаДанныеЗадач();
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	РезультатЗапроса = Запрос.Выполнить();
	
	Ютест.ОжидаетЧто(РезультатЗапроса.Колонки)
		.ЛюбойЭлементСодержитСвойствоСоЗначением("Имя", "Задача")
		.ЛюбойЭлементСодержитСвойствоСоЗначением("Имя", "Исполнитель")
		.ЛюбойЭлементСодержитСвойствоСоЗначением("Имя", "КодЗадачи")
		.ЛюбойЭлементСодержитСвойствоСоЗначением("Имя", "НаименованиеЗадачи")
		.ЛюбойЭлементСодержитСвойствоСоЗначением("Имя", "Проект")
		.ЛюбойЭлементСодержитСвойствоСоЗначением("Имя", "СтатусЗадачи")
		.ЛюбойЭлементСодержитСвойствоСоЗначением("Имя", "ХранилищеФотографии")
		;
	
КонецПроцедуры

&НаСервере
Процедура ТекстЗапросаСтатусы() Экспорт
	
	ТекстЗапроса = канбан_КанбанДоскаПереопределяемый.ТекстЗапросаСтатусы();
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	РезультатЗапроса = Запрос.Выполнить();
	
	Ютест.ОжидаетЧто(РезультатЗапроса.Колонки)
		.ЛюбойЭлементСодержитСвойствоСоЗначением("Имя", "Статус")
		.ЛюбойЭлементСодержитСвойствоСоЗначением("Имя", "Представление")
		.ЛюбойЭлементСодержитСвойствоСоЗначением("Имя", "УникальныйИдентификатор")
		;
	
КонецПроцедуры

#КонецОбласти

#Область канбан_Задачи

&НаСервере
Процедура ПустойРедактор() Экспорт
	
	ЭталонныйТекстРедактора = "";
	
	ЮТест.ОжидаетЧто(канбан_КанбанДоска)
		.Метод("ТекстHTMLРедактора").Параметр(ЭталонныйТекстРедактора).Параметр("")
		.НеВыбрасываетИсключение()
	;
	
	ДвоичныеДанныеМакета = Справочники.канбан_Задачи.ПолучитьМакет("РедакторЗадач");
	ЭталонныйТекстРедактора = ПолучитьСтрокуИзДвоичныхДанных(ДвоичныеДанныеМакета);
	
	ФактическийТекстРедактора = "";
	АдресВременноеХранилищеРедактора = "";
	канбан_КанбанДоска.ТекстHTMLРедактора(АдресВременноеХранилищеРедактора, "");
	
	ДвоичныеДанныеРедактора = ПолучитьИзВременногоХранилища(АдресВременноеХранилищеРедактора);
	ФактическийТекстРедактора = ПолучитьСтрокуИзДвоичныхДанных(ДвоичныеДанныеРедактора);
	
	ЮТест.ОжидаетЧто(ФактическийТекстРедактора)
		.ИмеетТип("Строка")
		.Заполнено()
		.Равно(ЭталонныйТекстРедактора)
	;
	
КонецПроцедуры

#КонецОбласти

#Область Прочее

// Создает новый объект справочника, если он не существует.
//
// Параметры:
//   ПолноеИмяОбъектаСтатусы - Строка - полное имя объекта справочника
//   УникальныйИдентификаторСтрока - Строка - уникальный идентификатор объекта
//   НаименованиеОбъекта - Строка - наименование объекта справочника
//
// Возвращаемое значение:
//   СправочникСсылка - ссылка на созданный или существующий объект справочника
//
&НаСервере
Функция СоздатьНовыйОбъектСправочника(ПолноеИмяОбъектаСтатусы, УникальныйИдентификаторСтрока, НаименованиеОбъекта);
	
	ИмяСправочника = СтрРазделить(ПолноеИмяОбъектаСтатусы, ".")[1];
	ПолучитьСсылкуСправочника = 
		СтрШаблон(
			"Справочники.%1.ПолучитьСсылку(Новый УникальныйИдентификатор(""%2""))", 
			ИмяСправочника, 
			УникальныйИдентификаторСтрока);
	УстановитьБезопасныйРежим(Истина);
	ОбъектСсылка = Вычислить(ПолучитьСсылкуСправочника); // СправочникСсылка
	УстановитьБезопасныйРежим(Ложь);
	
	Если ПустаяСтрока(ОбъектСсылка.ВерсияДанных) Тогда
		
		ОбъектСсылка = ЮТест.Данные().КонструкторОбъекта(ПолноеИмяОбъектаСтатусы)
			.УстановитьСсылкуНового(УникальныйИдентификаторСтрока)
			.Установить("Наименование", НаименованиеОбъекта)
			.Записать()
			;
		
	КонецЕсли;
	
	Возврат ОбъектСсылка;
	
КонецФункции

// Удаляет не предопределенные элементы справочника.
//
// Параметры:
//   ПолноеИмяОбъекта - Строка - Имя определяемого типа, для которого необходимо удалить не предопределенные элементы
//
&НаСервере
Процедура УдалитьНеПредопределенныеЭлементы(ПолноеИмяОбъекта) Экспорт
	
	ИмяОбъекта = СтрРазделить(ПолноеИмяОбъекта, ".")[1];
	Выборка = Справочники[ИмяОбъекта].Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Попытка
			
			Если Не Выборка.Предопределенный Тогда
				
				ЭлементОбъект = Выборка.ПолучитьОбъект();
				ЭлементОбъект.Удалить();
				
			КонецЕсли;
			
		Исключение
			
			Продолжить;
			
		КонецПопытки
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьТекстHTMLКанбанДоски(Знач ИмяМакетаЭталона, ТекстДоски = "") Экспорт
	
	Если ПустаяСтрока(ТекстДоски) Тогда
		
		ТекстДоски = ""; // Строка
		
		ЮТест.ОжидаетЧто(канбан_КанбанДоска)
			.Метод("ТекстHTMLКанбанДоски").Параметр(ТекстДоски).Параметр("").Параметр(Ложь)
			.НеВыбрасываетИсключение()
		;
		
		канбан_КанбанДоска.ТекстHTMLКанбанДоски(ТекстДоски, "", Ложь);
		
	КонецЕсли;
	
	// Убираем непечатаемые символы
	ТекстДоски = НормализоватьТекст(ТекстДоски);
	
	МакетТекста = ПолучитьОбщийМакет(ИмяМакетаЭталона);
	ТекстHTMLДоскиЭталон = МакетТекста.ПолучитьТекст();
	
	РегулярноеВыражение1 = "v8config:\/\/[a-f0-9]{40}"; // Заменяем v8config с уникальным гуидом на пустоту
	ТекстHTMLДоскиЭталон = СтрЗаменитьПоРегулярномуВыражению(ТекстHTMLДоскиЭталон, РегулярноеВыражение1, "");
	
	ТекстДоски = СтрЗаменитьПоРегулярномуВыражению(ТекстДоски, РегулярноеВыражение1, ""); // Заменяем v8config с уникальным гуидом на пустоту
	
	ЮТест.ОжидаетЧто(ТекстДоски)
		.ИмеетТип("Строка")
		.Заполнено()
		.Равно(ТекстHTMLДоскиЭталон);
	
КонецПроцедуры

&НаСервере
Функция НормализоватьТекст(Знач ВхТекст) Экспорт
	
	// 1. Убираем "солнышки" и неразрывные пробелы
	ВхТекст = СтрЗаменитьПоРегулярномуВыражению(ВхТекст, "[\x{00A4}\x{00A0}]", " ");
	
	// 2. Заменяем все переносы строк на стандартные (Символы.ПС)
	ВхТекст = СтрЗаменить(ВхТекст, Символы.ВК + Символы.ПС, Символы.ПС);
	
	// 3. Убираем пробелы по краям
	Возврат СокрЛП(ВхТекст);
	
КонецФункции

&НаКлиенте
Функция ТекстРеквизитаФормыКанбанДоска()
	
	ПараметрыФормы = Новый Структура("СкрыватьФотоПользователя", Истина);
	//@skip-check use-non-recommended-method
	ФормаДоски = ПолучитьФорму("Обработка.Канбан_Доска_HTML.Форма.Доска", ПараметрыФормы);// получаем форму и сверяем доску с эталоном.
	
	СтатусЗагрузкиДокумента = ФормаДоски.Элементы.КанбанДоска.Документ.readyState;
	ДокументСформирован = (СтатусЗагрузкиДокумента = "complete");
	Пока Не ДокументСформирован Цикл
		
		ЮТест.Пауза(1);
		ДокументСформирован = ФормаДоски.Элементы.КанбанДоска.Документ.readyState = "complete";
		
	КонецЦикла;
	
	РеквизитКанбанДоска = ФормаДоски.КанбанДоска;
	
	Возврат РеквизитКанбанДоска
	
КонецФункции

// см. канбан_ТестыВызовСервера.ИзменитьДанныеЗадачи
&НаСервере
Процедура ИзменитьДанныеЗадачи(	
	Знач ИдентификаторЗадачаСтрока, 
	Знач НовыйСтатусИдентификаторСтрока, 
	ТекущийСтатусИдентификаторСтрока = "", 
	ИдентификаторИсполнителяСтрока = "") Экспорт
	
	Отказ = Ложь;
	
	ИдентификаторЗадача = Новый УникальныйИдентификатор(ИдентификаторЗадачаСтрока);
	
	ТипЗадачи = Метаданные.ОпределяемыеТипы.канбан_Задачи.Тип.Типы()[0];
	ПустаяСсылкаЗадача = Новый (ТипЗадачи); // ОпределяемыйТип.канбан_Задачи
	МенеджерЗадач = ОбщегоНазначения.МенеджерОбъектаПоСсылке(ПустаяСсылкаЗадача);
	
	ЗадачаСсылка = МенеджерЗадач.ПолучитьСсылку(ИдентификаторЗадача);
	РеквизитыЗадачи = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЗадачаСсылка, "Статус, Исполнитель");
	ТекущийСтатус = РеквизитыЗадачи.Статус;
	ТекущийСтатусИдентификатор = ТекущийСтатус.УникальныйИдентификатор();
	ТекущийСтатусИдентификаторСтрока = Строка(ТекущийСтатусИдентификатор);
	
	ТипСтатус = Метаданные.ОпределяемыеТипы.канбан_СтатусыЗадач.Тип.Типы()[0];
	МетаданныеСтатус = Метаданные.НайтиПоТипу(ТипСтатус);
	МенеджерСтатус = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(МетаданныеСтатус.ПолноеИмя());
	НовыйСтатусИдентификатор = Новый УникальныйИдентификатор(НовыйСтатусИдентификаторСтрока);
	НовыйСтатусСсылка = МенеджерСтатус.ПолучитьСсылку(НовыйСтатусИдентификатор);
	
	Если ПустаяСтрока(ИдентификаторИсполнителяСтрока) Тогда
		ИдентификаторИсполнителяСтрока = Строка(РеквизитыЗадачи.Исполнитель.УникальныйИдентификатор());
	КонецЕсли;
	
	ДанныеПриИзмененииСтатуса = Новый Структура;
	ДанныеПриИзмененииСтатуса.Вставить("ИдентификаторЗадача", ИдентификаторЗадачаСтрока);
	ДанныеПриИзмененииСтатуса.Вставить("ИмяМенеджераОбъектаЗадача", Метаданные.НайтиПоТипу(ТипЗадачи).ПолноеИмя());
	ДанныеПриИзмененииСтатуса.Вставить("ИдентификаторСтатуса", НовыйСтатусИдентификаторСтрока);
	ДанныеПриИзмененииСтатуса.Вставить("ИмяМенеджераОбъектаСтатус", МетаданныеСтатус.ПолноеИмя());
	ДанныеПриИзмененииСтатуса.Вставить("ИдентификаторИсполнителя", ИдентификаторИсполнителяСтрока);
	
	ЮТест.ОжидаетЧто(канбан_КанбанДоска)
		.Метод("ИзменитьСтатусЗадаче").Параметр(ДанныеПриИзмененииСтатуса).Параметр(Отказ)
		.НеВыбрасываетИсключение()
		;
	
	Ютест.ОжидаетЧто(Отказ)
		.Равно(Ложь);
	
	ТекущийСтатусПослеИзменения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗадачаСсылка, "Статус");
	
	Ютест.ОжидаетЧто(ТекущийСтатусПослеИзменения)
		.Заполнено()
		.Равно(НовыйСтатусСсылка)
		;
	
КонецПроцедуры

&НаСервере
Функция СоздатьНовуюЗадачу() Экспорт
	
	ПолноеИмяОбъектаЗадачи = канбан_КанбанДоска.ПолноеИмяОбъектаМетаданныхОпределяемогоТипа("канбан_Задачи"); // Строка
	ВтораяЗадачаЧетвертогоЭпика = ЮТест.Данные().КонструкторОбъекта(ПолноеИмяОбъектаЗадачи)
		.Установить("Родитель", Справочники.канбан_Задачи.НайтиПоНаименованию("Четвертый эпик", Истина)) 
		.Установить("Наименование", НСтр("ru = 'Вторая задача четвертого эпика'"))
		.УстановитьСсылкуНового("722b2c7b-127e-11f1-9572-e8bfb8e5e600")
		.Установить("Проект", Справочники.канбан_Проекты.НайтиПоНаименованию("Четвертый проект", Истина)) 
		.Установить("Исполнитель", Справочники.Пользователи.НайтиПоНаименованию("Ермаков Виктор", Истина)) 
		.Установить("ОсновнаяЗадача", Справочники.канбан_Задачи.НайтиПоНаименованию("Четвертый эпик", Истина)) 
		.Установить("Статус", Справочники.канбан_СтатусыЗадач.НайтиПоНаименованию("На тестировании", Истина))
		.Установить("ЭтоОсновнаяЗадача", Ложь) 
		.Установить("ПоказыватьВОтчетахИКанбанДоске", Истина) 
		.Записать()
		;
	
	Возврат ВтораяЗадачаЧетвертогоЭпика;
	
КонецФункции

#КонецОбласти

#КонецОбласти
